{
    "name": "Agile Africa 2017",
    "description": "Agile Africa 2017",
    "about": {
        "imageSrc": "img/icon.png",
        "heading": "Agile Africa 2017",
        "subHeading": "About the conference",
        "description": "2017 marks the five-year anniversary of the Agile Africa conference, and we will build on previous years to create an engaging, memorable event. Our keynotes for the Agile Africa 2017 conference include leading experts of international acclaim. Furthermore, the conference includes a diversity of both local and international speakers, and you will get to interact with and learn from people working in all different environments. ",
        "website": "",
        "links": [
            {
                "linkText": "Give us feedback!",
                "text": "",
                "link": "https://cloudcallio.typeform.com/to/jiXxOG"
            }
        ]
    },
    "schedule": [
        {
            "date": "21st August 2017",
            "groups": [
                {
                    "time": "7:30 am",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [],
                            "description": "<p></p>",
                            "name": "Lean Coffee (Day 1)",
                            "locationId": "foyer",
                            "timeStart": "7:30 am",
                            "timeEnd": "8:30 am",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": []
                        }
                    ]
                },
                {
                    "time": "8:00 am",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [],
                            "description": "<p>Please visit the Welcome Desk in the Foyer to register.</p><br><p></p>",
                            "name": "Registration",
                            "locationId": "foyer",
                            "timeStart": "8:00 am",
                            "timeEnd": "9:00 am",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": []
                        }
                    ]
                },
                {
                    "time": "9:00 am",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p></p>",
                                    "name": "Joanne Perold",
                                    "priority": 1
                                },
                                {
                                    "about": "<p></p>",
                                    "name": "Barry Dwolatzky",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Prof-Barry-Dwolatzky-small.jpg"
                                }
                            ],
                            "description": "<p></p>",
                            "name": "Welcome",
                            "locationId": "ballroom",
                            "timeStart": "9:00 am",
                            "timeEnd": "9:20 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Joanne Perold",
                                "Barry Dwolatzky"
                            ]
                        }
                    ]
                },
                {
                    "time": "9:20 am",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p></p>",
                                    "name": "Kent Beck",
                                    "priority": 1,
                                    "profilePic": "img/speakers/kent-beck.jpg"
                                }
                            ],
                            "description": "<p></p>",
                            "name": "Kent Beck Keynote",
                            "locationId": "ballroom",
                            "timeStart": "9:20 am",
                            "timeEnd": "10:20 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Kent Beck"
                            ]
                        }
                    ]
                },
                {
                    "time": "10:30 am",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [],
                            "description": "<p>Lots of conversations and open space stuff happening here , join the fishbowl, have a look at the posters or just have an impromptu conversation</p><br><p></p>",
                            "name": "Indaba Tree Day 1",
                            "locationId": "foyer",
                            "timeStart": "10:30 am",
                            "timeEnd": "5:00 pm",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": []
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Simplifier-in-Chief for KRS software. An early female entrepreneur, with a love of software and people, and how both mix to solve problems.</p><br><p></p>",
                                    "name": "Lorraine Steyn",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Lorraine.jpg"
                                }
                            ],
                            "description": "<p>Product Owners are critical in an Agile team: they are the primary link between business and developers. But the role, as defined in Scrum, expects so much of the Product Owner that we could rather wish for unicorns!</p><br><p>This interactive workshop will explore the Product Owner role, and guide you to your own decisions on how to make the role work for your team.</p><br><p></p>",
                            "name": "Workshop: Product Owner Unicorns",
                            "locationId": "boundary-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "12:00 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Lorraine Steyn"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Adam is both the Chief Operating Officer at Platform45 as well as a Product Owner, working with two of their talented teams to design and build beautiful software that matters. Adam loves building the teams that build great product.</p><br><p></p>",
                                    "name": "Adam Sachs",
                                    "priority": 1,
                                    "profilePic": "img/speakers/adam.png"
                                },
                                {
                                    "about": "<p>Simon is a Technical Product Lead at Platform45, interested in everything software from design & development to machine learning. On his journey, Simon loves sharing his learnings, and has given a couple talks in South Africa and the USA. Catch him on Github (@sighmin), or at simonvandyk.co.za.</p><br><p></p>",
                                    "name": "Simon van Dyk",
                                    "priority": 1,
                                    "profilePic": "img/speakers/simon.jpg"
                                }
                            ],
                            "description": "<p>Platform45 has long believed that it’s at the intersection of technology and the liberal arts that real change happens. We’ve made mistakes in how we manage projects and our workforce. We’re by no means a perfect company, but over the years we have learnt valuable lessons. We’ve learnt to embrace Agile principles and later stumble upon it’s practices. We’ve learnt about how to grow the role of design and collaboration in our company, and how to efficiently scale beyond our size using these techniques. This is the telling of Platform45’s Agile Design and Development story. Find out more at platform45.com.</p><br><p></p>",
                            "name": "Platform45’s Agile Design and Development Journey",
                            "locationId": "ballroom",
                            "timeStart": "10:30 am",
                            "timeEnd": "11:15 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Adam Sachs",
                                "Simon van Dyk"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Don Gray’s quest to answer “What is the earliest indicator for a project’s status?” has led him to focus on such diverse topics as communication, personality types, team styles, systems thinking and human systems dynamics. For more than 30 years, his clients have ranged from small startups to Fortune 50 involving manufacturing, pharmaceuticals, financial, engineering and telecommunications. Don’s varied interests and client experience provides a platform for helping clients introduce and work through change as they transition to agile development practices. With Esther Derby, he facilitates the Coaching Beyond the Team and Problem-Solving Leadership workshops. Don occasionally writes articles that can be found in STQE, Better Software and on StickyMinds. He contributed to “Readings for Problem-Solving Leadership” and “Center Enter Turn Sustain – Essays on Change Artistry”. His blog can be found at www.donaldegray.com</p><br><p></p>",
                                    "name": "Don Gray",
                                    "priority": 1,
                                    "profilePic": "img/speakers/don-gray.png"
                                }
                            ],
                            "description": "<p>“Why doesn’t my manager listen when I explain the details?”</p><br><p>“Why doesn’t the developer just give me what I ask for?”</p><br><p>If you’ve ever heard these complaints—or made them–you’re not alone. Questions like these are a symptom of incongruent communication. Incongruent communication happens every day a variety of reasons.</p><br><p>In this session we’ll explore the Satir Interaction Model, Congruence and how they combine (or not) creating congruent communication. Additionally we’ll consider how metaphors limit solutions and acceptable actions when problem solving.</p><br><p></p>",
                            "name": "Workshop: Congruent Communication",
                            "locationId": "gala-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "12:00 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Don Gray"
                            ]
                        }
                    ]
                },
                {
                    "time": "11:15 am",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I am a Senior Software Engineer at Dariel with a degree in Electrical Engineering and broad experience across multiple industries. My work previous experience includes application design and development; system integration; and I am currently the Senior Engineer in the design and development of infrastructure automation tool for a major South African bank.</p><br><p>Programming, code and computers have been a huge passion for me from as early as I can remember; and I am currently completing a Masters in Software Engineering. I love working in teams and sharing the things I’ve learned with others. My other interests include playing guitar; Minecraft (with automation, of course); board games; and other computer games. I also enjoy astronomy; camping; hiking; travelling and art.</p><br><p></p>",
                                    "name": "Geoffrey Lydall",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>Infrastructure as code has become a buzz word around IT automation with organisations scrambling to try and implement a solution – but is this really something that you need, and is it right for your organisation?</p><br><p>This talk sheds some light as to what exactly this trend is all about, how we’ve implemented it at our customer and what you need to know when embarking on such a journey. We cover some valuable lessons learned along the way using Chef and Terraform on Amazon Web Services and VMWare.</p><br><p></p>",
                            "name": "Infrastructure as Code: Should you be using it and what worked for us",
                            "locationId": "ballroom",
                            "timeStart": "11:15 am",
                            "timeEnd": "12:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Geoffrey Lydall"
                            ]
                        }
                    ]
                },
                {
                    "time": "12:00 pm",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [],
                            "description": "<p></p>",
                            "name": "Poster Sessions",
                            "locationId": "foyer",
                            "timeStart": "12:00 pm",
                            "timeEnd": "12:30 pm",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": []
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I graduated from WITS with a BSc (Comp Sci) 1991. I have since been working in the software industry on initiatives of many different scales and technologies. Most recently I have had some forays into Enterprise Architecture that have left me questioning what valuable practices actually are. I am currently the CTO and a director of Dariel. Even at this stage of my career I still maintain a passion for the workings “nuts and bolts” and thus maintain my programming competency. I am a firm believer in Lean and Kaizen and the original principles that have since been translated into Agile Software methodologies.</p><br><p></p>",
                                    "name": "Wayne Yan",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>Whilst “agile” normally refers to a methodology or socially engineered way of working are there certain approaches at an architectural level that lead themselves to agility? Whilst we may not specifically identify with agile architectures we are duly cognisant of what architectures do not lend themselves to high quality, fast change. In the world on enterprise architecture compliance and governance the role finds itself far removed from the tangible value chain. This session is for the architect, come technical lead who has pondered these same questions.</p><br><p></p>",
                            "name": "Lightning Talk: Agile Architecture – is there such a thing?",
                            "locationId": "boundary-room",
                            "timeStart": "12:00 pm",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Wayne Yan"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Yogini is a Scrum Master, aspiring Agile Coach in Barclays Africa (South Africa).\nYogini first encountered Agile in 2014 and has been learning about and doing it\never since. She loves how simple in is to do and benefits can be seen\nimmediately.</p><br><p></p>",
                                    "name": "Yogini Moodley",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>This talk is about how I embarked on my journey of learning. I was born in the 80’s, a straight A student, hard working, going to the library, I even used cool things like Encarta ’95 in 2000. I have a much younger brother. He learnt very differently to me. He would google for translation while I would use a dictionary. I would go for music lessons, he learnt to play the guitar watching YouTube. Reflecting recently I realized that his way was not wrong and my way was not the only way. Times have changed, learning has evolved. Rather than focusing on just certificates and degrees, teachers and classrooms. I’ve immersed myself in the world of learning. Learning happens all the time in many ways.</p><br><p></p>",
                            "name": "Lightning Talk: Learning to learn",
                            "locationId": "gala-room",
                            "timeStart": "12:00 pm",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Yogini Moodley"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Greg is a member of the BSG Business Analytics team specialising in the role of Business Domain and Business Intelligence.\nGreg has over 12 years of experience in Logistics, Financial Services, Automotive and Mining where he has gained extensive knowledge of agile project delivery in a variety of roles including:\n•         Project manager\n•         Project risk management\n•         Project assurance and compliance\n•         Business analysis\n•         Data & analytics\n•         Business intelligence and reporting</p><br><p></p>",
                                    "name": "Greg Desilla",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Greg-Desilla-email.jpg"
                                },
                                {
                                    "about": "<p>Leading the BSG business analytics capability as principal business consultant, Julia strongly believes in the value of deriving business intelligence from data to improve business performance.</p><br><p>Her experience in academia, inventory management, supply chain management, supply chain analytics, business analytics and business intelligence span the motor, retail, logistics, telecommunications and banking sectors.</p><br><p>With a PhD in Mathematical Statistics from the Nelson Mandela Metropolitan University, Julia has delivered a range of business analytics solutions, focused on solving business problems by surfacing the right intelligence to enable fact-based decisions. During the past few years she has focused her career in the field of data science, a natural progression from her statistics roots. Julia is skilled in playing the integration role between business decision makers and their technology service providers.</p><br><p></p>",
                                    "name": "Julia Keddie",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Julia-Keddie-email.jpg"
                                }
                            ],
                            "description": "<p>This session is targeted at leaders in organisations who want to understand what multi-skilled delivery looks like, to enable their companies to embrace agility. An agile company requires multi-skilled delivery, which in turn requires t-shaped people.</p><br><p>A t-shaped person is cross-functionally diverse, ensuring the job will get done. They combine a breadth of knowledge with deep experience, ensuring they can work outside of their core area.</p><br><p>This talk will explore the challenges and successes that arise from multi-skilled delivery using a real life project that combined analysis, design, strategy, data science and scrum.</p><br><p></p>",
                            "name": "Lightning Talk: What does organisational agility look like and who makes it happen: the age of the t-shaped employee",
                            "locationId": "ballroom",
                            "timeStart": "12:00 pm",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Greg Desilla",
                                "Julia Keddie"
                            ]
                        }
                    ]
                },
                {
                    "time": "12:15 pm",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I am a senior quality assurance consultant at Thoughtworks and, since 1999, have specialised in software testing and quality assurance. I believe it offers more opportunities than straight development.</p><br><p>As a result, I’ve had the good fortune to gain exposure to a wide range of remarkable opportunities in South Africa and the United States, being exposed to the concrete elements of best practices across a range of disciplines, assignments, projects, organisations and industries. I am fascinated by the constant change, which ensures there is always something new for me to learn.</p><br><p>In my spare time I run 5km, 10km and half marathon races.</p><br><p></p>",
                                    "name": "Wayne Sinclair",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>Predictive analytics can be used to make predictions about future events. In software testing we can use data from previous projects to predict failure points in future testing activities. We then have the the ability to optimize project data and make proactive decisions. We can invest in and experiment with tools that enable us to analyse the root cause of defects, analyse coverage and efficiency of test sets, analyse utilisation of resources and environments, predict estimation based on requirements, predict risk areas and risk levels of projects, and plan the priority of test cases.</p><br><p></p>",
                            "name": "Lightning Talk: Its all in the numbers – predictive analytics in software testing",
                            "locationId": "gala-room",
                            "timeStart": "12:15 pm",
                            "timeEnd": "12:30 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Wayne Sinclair"
                            ]
                        }
                    ]
                },
                {
                    "time": "1:30 pm",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I’m a software engineer and have been professionally involved in software development of mission-critical systems for about 15 years. Most of my experience has been in developing crucial font-end applications in the financial industries: online trading, online banking, insurance and branch banking.</p><br><p></p>",
                                    "name": "Jacques de Vos",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Jacques.jpg"
                                }
                            ],
                            "description": "<p>Treating your mature enterprise product carelessly will get your business into deep trouble, but gold plating a new product, before you are sure that you are building the right thing, is extremely wasteful.</p><br><p>Although this might seem like common sense, most debates about software practices are still based on the assumption that there is one best practice for all contexts. It took us few failed software product startups and unstable mature products to learn this, and how to adjust our way of work, depending on the business context.</p><br><p>This idea has finally been expressed by a few prominent thinkers, like:\n• Kent Beck’s 3X\n• Simon Wardley’s Pioneers Settlers and Town Planners\n• Jeff Patton’s Dual Track Development</p><br><p>In this talk I will take you through important differences in the 2 contexts, share stories of our own failures and successes, and give you some practical advice on adjusting your approach for the context.</p><br><p>This talk is for any software professional who cares about business value.</p><br><p></p>",
                            "name": "Pioneers and town planners – software best practice is dead",
                            "locationId": "gala-room",
                            "timeStart": "1:30 pm",
                            "timeEnd": "2:15 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Jacques de Vos"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I was a PM, come BA and have since morphed myself into a Scrum master, doing some agile coaching on the side.  I have been a Scrum master for just over 3 years now. I have an Honours degree in Psychology and continue to be fascinated by what makes people tick and am myself on an ongoing journey of self improvement.</p><br><p></p>",
                                    "name": "Catherine Holland",
                                    "priority": 1,
                                    "profilePic": "img/speakers/catherine.jpg"
                                }
                            ],
                            "description": "<p>I would like to share with you what I’ve learnt from world class leaders by applying these tools and tactics to my own life and I would like to encourage you to try some of these at home. Wouldn’t you like to know more about what makes these leaders so successful and start applying their habits and routines yourself? Well you can start today, right now if you attend my talk.</p><br><p>Learn more about practising micro bravery and how to increase your productivity. Take on the coffee challenge and I’m not just talking about drinking more coffee. Motivate yourself so that you can motivate others.</p><br><p>We hear so much about Continuous improvement being core to applying Agile in a useful manner so I would like to encourage all of you to self-reflect regularly on how to become more effective. Focus is not just a value, it’s a practise. Courage is not taught, it is tried and tried again and being happy and healthy takes some effort. It involves practise and training.</p><br><p></p>",
                            "name": "Continuous Improvement starts with you",
                            "locationId": "boundary-room",
                            "timeStart": "1:30 pm",
                            "timeEnd": "2:15 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Catherine Holland"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Cara is the COO and Agile Coach at Project codeX, a disruptive education initiative that equips aspiring coders with high quality skills and experience, while bridging the digital divide.</p><br><p>Her ultimate goal is for us all to find the work we love doing, and build a better future doing it. Having spent years helping teams adopt agile practices that reduce risk and increase workplace happiness, she now helps aspiring coders to discover and follow their tech passions, on their journey to become agile software developers.</p><br><p>She has an insatiable love of learning, and cares deeply about sharing knowledge to build stronger communities and foster greater diversity in the software world.</p><br><p></p>",
                                    "name": "Cara Turner",
                                    "priority": 1,
                                    "profilePic": "img/speakers/cara-turner.jpg"
                                }
                            ],
                            "description": "<p>Diversity is much-praised for fostering healthier and more innovative workplaces. But whichever way you slice ‘diversity’, the majority of our teams reflect one demographic, and simply adding “a diverse hire” won’t magically produce these results. So are the claims true? If so, what else do we need to do?\nThrough our time training and placing coders from widely differing backgrounds we’ve had to get to grips with the realities of integrating teams.</p><br><p>This talk looks at the importance of inclusive practices and explores the link with quality and innovation. We also investigate some of the unconscious biases and infrastructure challenges that reinforce exclusion.\nWith collaboration at their heart, agile teams are best placed to promote inclusion. How can we extend agile practices to place conscious attention on creating connections and to build truly healthy, demographically representative teams?</p><br><p></p>",
                            "name": "Beyond Diversity: Embracing Inclusion",
                            "locationId": "ballroom",
                            "timeStart": "1:30 pm",
                            "timeEnd": "2:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Cara Turner"
                            ]
                        }
                    ]
                },
                {
                    "time": "2:30 pm",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I am a father and a husband with a passion for reading, MMA, English football and science fiction. I refer to myself as recovering traditional leader with a focus on developing high performing people,teams and organisation’s. Having spent the last 15 years in financial technology in Africa and have had the privilege of having a diverse career leading departments across  networks, distributed technologies, end user technologies within 12 African countries which has exposed me to all facets of a large enterprise. In the last few years I have been focused on business strategy and leadership and through my current role as the head of Agile transformation and strategy, have been driving a new way of thinking and radical management within my organisation. I received my MBA from GIBS with a specialisation in people and basic psychological needs within the workplace providing me a better understanding into intrinsic motivation and how to structure organisation’s to support the right culture.</p><br><p></p>",
                                    "name": "James Knupfer",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>How do you balance the eco-system of an Agile culture?</p><br><p>Transforming enterprises to an Agile way of working is mostly uncharted territory, the enormity of twenty thousand plus people being part of the change is both intimidating and yet at the same time a relishing challenge, a real David and Goliath story being lived out in our time. As the lead for Agile transformation in one of the largest banks in Africa I am severely aware of this mammoth transformation endeavor that lies ahead of a number of my Agile comrades.</p><br><p>If you are in a position to teach, coach or influence the agile transformation of your enterprise organisation, whether in a leadership position or a change agent, and are concerned about the embedded sustainability of your agile transformation, then this presentation will appeal to you.</p><br><p>Our immediate inclination in an Agile transformation is to just get started by educating, restructuring and creating product/Scrum teams – in an enterprise this can be effective however is not sustainable. We need enterprises to transcend their view of Agile as just a set of values and principles in the service of software delivery and instead consider it as an eco-system that must be balanced and maintained. In this presentation I will describe the eco-system that supports sustainable enterprise Agile transformation (SEAT) and delve into how they must be influenced to develop a transformation program. There must be a people centric mindset at the core of what they do, so that it supports the organisation’s agile culture transformation.</p><br><p>I will delve into the importance of human resources as a lynch pin to Agile transformation, look at how project and change departments must fundamentally change their view on their existence in the new way of working as well as how marketing must be driven by product and not the other way around. We will unpack the transformation required by finance to be less focused on profit and loss and more on value for money. I will highlight the importance of how business and technology risk must re-evaluate the measures of risk to the business from a financial, operational, compliance and reputational perspective. We will also lift the lid on how audit and legal need to relinquish a significant level of control on the premise of delivering customer value.</p><br><p>The presentation concludes with the bringing together of all the parts of the eco-system through authentic leadership and how easily management can derail your transformation.</p><br><p></p>",
                            "name": "Sustainable Enterprise Agile Transformation: The Agile Eco-System",
                            "locationId": "ballroom",
                            "timeStart": "2:30 pm",
                            "timeEnd": "3:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "James Knupfer"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Testing is not just a career to me, it is a massive part of who I am. I have been blessed to come across people who have inspired me and taught me and I believe I have been that person to others over the years. The learning never stops though, and I continue to practice the craft and apply learnings from other disciplines back into software testing.</p><br><p>I am at my happiest when I see a team able to do their best testing work and add valuable information into the system. One way I like to do this is to be part of the team. Mentoring and coaching the team from an external viewpoint is also something I am comfortable with. I realise that much of the work we do is heavily influenced by the greater system we are in. I have many years experience of making these things visible and coming up with practical ideas to maximize the value derived from the testing efforts.</p><br><p>Building the craft and community of testing in South Africa is also a passion of mine. To this end, I am the co-organiser of Let’s Test South Africa and the founder and co-organiser of the Joburg Software Testers Meetup.</p><br><p>I enjoy speaking at conferences and have spoken at Let’s Test in Sweden, Copenhagen Context and CAST in North America and I was the co-program chair for CAST 2013.</p><br><p>As Director and Consultant at House of Test South Africa, I am hoping to continue working with awesome people, partnering with friends whom I respect and working my butt off to promote $hit HoT testing.</p><br><p></p>",
                                    "name": "Louise Perold",
                                    "priority": 1
                                },
                                {
                                    "about": "<p>Joshua is an experienced Agile and Developer coach. He also lectures part-time at a post-graduate level.</p><br><p></p>",
                                    "name": "Joshua Lewis",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Josh.jpg"
                                }
                            ],
                            "description": "<p>Do your product managers, developers and testers have different interprations and understanding of the requirements of your software systems? Many organisations struggle to achieve a single, shared understanding of what problem they’re trying to solve with their software, and how they actually expect their software systems to behave. This leads to much wasted time and effort in the software development process. During my coaching and training I have developed a practice designed for whole-team collaborative exploration and specification of expected system behaviour. The practice leads to shared understanding across entire teams, as well as lightweight documentation which can be easily turned into automated tests.</p><br><p></p>",
                            "name": "Workshop: Collaborative Exploration and Specification",
                            "locationId": "boundary-room",
                            "timeStart": "2:30 pm",
                            "timeEnd": "4:00 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Louise Perold",
                                "Joshua Lewis"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Sonja partners with leaders and other practitioners to enable responsive and agile organisations and make sense of complex problems like culture and change. She does this through the use of pioneering ideas and tools from complexity theory and narrative practice. Her expertise lies in enabling environments in organisations where thinking and behaviour shifts toward greater strategic agility and resilience. Focus areas include: enabling change resilience; effective strategy execution; devolved decision-making; sense-making; and culture.</p><br><p>Sonja has over 15 years experience consulting locally and internationally. Prior to founding More Beyond, she consulted for PWC and IBM. She is the exclusive South African partner for Prof Dave Snowden’s company Cognitive Edge and supplies training in their open source methods; the Cynefin sense-making framework as well as the Sensemaker software suite.</p><br><p></p>",
                                    "name": "Sonja Blignaut",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Sonja-sml.jpg"
                                }
                            ],
                            "description": "<p>In today’s VUCA world, organisations are on a quest to become more agile and responsive. The Agile community has found themselves at the “spearhead”, and as the ideas mature, questions around scaling beyond small teams and beyond IT have become pertinent and in many cases seem intractable.</p><br><p>In this session we will go back to first principles and explore what we can learn from others who thrive in uncertainty and who seem to have perfected not only agility but responsiveness. We will apply ideas from complexity thinking and explore principles from the arts, the armed forces and sports teams. The focus will be on enabling strategic agility and responsiveness, not implementing Agile. We will also explore how this has been practically implemented in real client environments.</p><br><p></p>",
                            "name": "Workshop: Responsive Organisations: Enabling Strategic Agility (beyond Agile)",
                            "locationId": "gala-room",
                            "timeStart": "2:30 pm",
                            "timeEnd": "4:00 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Sonja Blignaut"
                            ]
                        }
                    ]
                },
                {
                    "time": "3:15 pm",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>My corporate role is as an Agile Coach within Standard Bank, however my focus and passion is more towards shifting mental models and how people show up so that they actively support and generate Agility (with detours to Kanban and visualisation – if you can’t see it (behaviour included), you seldom talk about it or change it). My goal is to find ways to find ways to generate tools that allow us as Agile coaches to practically and effectively engage with behaviour that often gets in the way of adopting Agile.\nI both facilitate this on our internal Servant Leadership labs as well as coach this as a new way of behaving in stand up’s, other ceremonies and one-on-one coaching sessions that allow individuals to explore their mindsets.\nMy passion for understanding and shifting mind-sets and behaviour started when I was able to shift my own thinking and so acquire the Guinness World Record for the Deepest Dive by a woman.</p><br><p></p>",
                                    "name": "Verna van Schaik",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Verna2017.jpg"
                                }
                            ],
                            "description": "<p>This session is targeted at Coaches and Leaders who are struggling with getting people to think Agile and so behave in an Agile manner. In particular, how do you get managers at all levels to shift out of the old waterfall way of thinking and behaving and really adopt Agile ? How do you get feature teams to be autonomous and self-managing ?\nWe know we need to address the behaviour and cultures that are thwarting Agility, but are stuck on the ‘how ? ’ As organisations and coaches, it is easy to coach only at a process level in the hope that by focusing people on ‘doing’ Agile they will start to ‘think’ Agile. In so doing, we often actively avoid focusing on the people and how they are engaging with Agile, believing that this is a specialized field outside of our scope and limited to people like therapists & professional coaches. This often results in a high demand and dependence on Agile coaches to ensure people stick to the processes and principles.\nAt its core, Agile is a shift away from unilateral control. Only unilateral control is a way of being that is deeply embedded within us (leaders and followers alike) and so hard to shift without a conscious intervention.\nWithin Standard Bank we have been implementing a Behaviour Laboratory run internally by IT resources that focuses on a new style of leadership – the mutual learning model. Introduced by Roger Schwartz in his book “The Skilled Facilitator”, mutual learning and its ground rules for collaboration create strong support for Agile and SAFE implementation at an individual level and in so doing, allows us to create and actively support an environment and behaviours that sustain the agile culture shift.</p><br><p></p>",
                            "name": "Agile Leadership Labs – Coaching for Agile Leadership",
                            "locationId": "ballroom",
                            "timeStart": "3:15 pm",
                            "timeEnd": "4:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Verna van Schaik"
                            ]
                        }
                    ]
                },
                {
                    "time": "4:15 pm",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Building the right software product in the right way is my passion. Working with teams and being part of a team that is building solutions that our users actually want or need is my commitment.\nI have 5 years of experience working in Agile teams across the banking and insurance industry in South Africa and Australia.\nI started my career as an agile business analyst then started doing a combination of BA and Iteration management. I majored in computer science and economics at the University of Witwatersrand. I currently work for a software consultancy called Khabane Majestic Consulting</p><br><p></p>",
                                    "name": "Liandra Bassiane",
                                    "priority": 1,
                                    "profilePic": "img/speakers/liandre.jpg"
                                }
                            ],
                            "description": "<p>Have you ever felt like you have all this agile knowledge that will make everyone’s life much easier and your team members don’t really get it or already have preconceived ideas on how agile doesn’t work and you have a feeling they thought agile is just having stickies and a board? And you want to know more about how do you bridge this gap how do you transform your team ? Get to that Aha moment.</p><br><p>Or answer questions and have good suggestions on dealing with</p><br><p>1. Stories not being completed in Production\n2. Ping pong on requirements from testing to dev\n3. Product owner not signing off what has been built because it’s not aligned to what they want\n4. External teams out outside the agile team saying things like “That agile team and they cowgirl and cowboy methods who are they to have less governance\n5. That difficult team member who just isn’t onboard</p><br><p>and so on..</p><br><p>I want to share my learnings, knowledge, and tips on how to answer these question and how to take your team and organization through these changes so we can move from pulling hairs not understanding each other to the AHA moment we building awesome products in the best way possible</p><br><p></p>",
                            "name": "The Journey of an Agile Coach/Scrum Master/BA from the hair pulling to those AHA ! moments",
                            "locationId": "boundary-room",
                            "timeStart": "4:15 pm",
                            "timeEnd": "5:00 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Liandra Bassiane"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Rouan Wilsenach is a software developer. He has built applications in a variety of technology stacks for companies in the financial services, education, health and media sectors. He’s worked as a consultant and coach, helping teams learn good engineering practices and helping businesses transform the way they build software. He now works remotely for Tes, where he builds full-stack JavaScript microservices to help teachers and schools.</p><br><p></p>",
                                    "name": "Rouan Wilsenach",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Rouan.jpg"
                                }
                            ],
                            "description": "<p>Things always go wrong in production, but this doesn’t have to be a bad thing. It’s an opportunity to learn about your system and the real world with which it interacts. Rouan will show you how to build a set of feedback mechanisms that help you find out about issues as they happen and ship fixes quickly. Using real examples, he’ll walk you through how they use metrics, logging, auditing and alerting to support tes.com and move fast. He’ll show you which tests to throw away and what to put in their place. He’ll guide you to finding the right balance of pre-production and production quality practices, so that you can gain a more realistic and holistic understanding of the quality of your system.</p><br><p></p>",
                            "name": "QA in Production: The tests we never wrote and the production monitoring we use instead",
                            "locationId": "ballroom",
                            "timeStart": "4:15 pm",
                            "timeEnd": "5:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Rouan Wilsenach"
                            ]
                        },
                        {
                            "date": "21st August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Travis is the Agile Practice Manager at Chillisoft. He has spent the last 11 years traveling and working around the world in various countries.\nHe is passionate about software quality management, craftsmanship and leadership.\nHe serves on the board of Open Data Durban, a non-profit civic technology lab and is an active member of the Durban software development community.</p><br><p></p>",
                                    "name": "Travis Frisinger",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>It seems like there are never enough developers to do the work and never enough time get the job done well.\nHow does a manager design a culture in which his team can deliver quickly, learn, grow and remain engaged?\nIf he is only focusing on technical skills and using out of the box Agile techniques he will only get so far.\nThis is because agile methods are great, but do not put enough emphasis on creating an amazing team culture.\nA culture where the team all believe in a shared set of values and norms related to software development, thus enabling high-performance.\nIn this talk I will explore the key processes I utilized and refined while managing a team South Africans and Omanis to deliver a collection of enterprise projects in the Gulf region.\nBy using processes focused on quality, communication and continuous improvement we delivered on time, on budget and lived up to our name, Team Awesome.</p><br><p></p>",
                            "name": "Building a High Performance Team",
                            "locationId": "gala-room",
                            "timeStart": "4:15 pm",
                            "timeEnd": "5:00 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Travis Frisinger"
                            ]
                        }
                    ]
                },
                {
                    "time": "5:00 pm",
                    "sessions": [
                        {
                            "date": "21st August 2017",
                            "speakers": [],
                            "description": "<p>Social event</p><br><p></p>",
                            "name": "Drinks",
                            "locationId": "foyer",
                            "timeStart": "5:00 pm",
                            "timeEnd": "7:00 pm",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": []
                        }
                    ]
                }
            ]
        },
        {
            "date": "22nd August 2017",
            "groups": [
                {
                    "time": "7:30 am",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [],
                            "description": "<p></p>",
                            "name": "Lean Coffee (Day 2)",
                            "locationId": "foyer",
                            "timeStart": "7:30 am",
                            "timeEnd": "8:30 am",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": []
                        }
                    ]
                },
                {
                    "time": "9:00 am",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [],
                            "description": "<p></p>",
                            "name": "Announcements",
                            "locationId": "ballroom",
                            "timeStart": "9:00 am",
                            "timeEnd": "9:10 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": []
                        }
                    ]
                },
                {
                    "time": "9:10 am",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Ryan Ripley has worked on agile teams for the past 10 years in development, scrum master and management roles. He’s worked at various fortune 500 companies in the medical device, whole sale, and financial services industries.</p><br><p>Ryan is great at taking tests and holds the PMI-ACP, PSM I, PSM II, PSE, PSPO I, PSD I, CSM, CSPO, CSP, and CAL1 agile certifications.</p><br><p>Ryan lives in Indiana with his wife Kristin and three children. He blogs at ryanripley.com and hosts the Agile for Humans podcast available on iTunes. You can also follow Ryan on twitter: @ryanripley</p><br><p></p>",
                                    "name": "Ryan Ripley",
                                    "priority": 1,
                                    "profilePic": "img/speakers/ryan-ripley.png"
                                },
                                {
                                    "about": "<p>With more than eighteen years of project delivery experience, Faye Thompson, JD, PSM1, is a senior agile consultant with CareWorks Tech. Focusing on agile methodologies and continuous improvement, she has had a positive impact in the financial services, healthcare, advertising, and automotive industries. Passionate about using innovative solutions to drive business value, Faye helps workgroups transform into highly engaged and energized teams. She enjoys serving on the board of directors for the Central Ohio Agile Association, volunteering as an instructor and emergency medical responder for the American Red Cross, and spending time with her husband and two dogs.</p><br><p></p>",
                                    "name": "Faye Thompson",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Faye-Thompson.jpg"
                                }
                            ],
                            "description": "<p>Does your team optimize their learning opportunities?  Is it safe to explore, experiment and fail?  Are you looking for some ideas on getting your team ‘unstuck’?  Bring your questions, as you are the product owner to this conversation about celebrating curiosity, becoming more agile and fostering an environment that allows your team to succeed. Leveraging the power of the crowd, we will address the questions of the room and facilitate a whole-conference conversation.</p><br><p></p>",
                            "name": "Keynote: Collaborative Curiosity",
                            "locationId": "ballroom",
                            "timeStart": "9:10 am",
                            "timeEnd": "10:10 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Ryan Ripley",
                                "Faye Thompson"
                            ]
                        }
                    ]
                },
                {
                    "time": "10:30 am",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [],
                            "description": "<p>Lots of conversations and open space stuff happening here , join the fishbowl, have a look at the posters or just have an impromptu conversation</p><br><p></p>",
                            "name": "Indaba Tree Day 2",
                            "locationId": "foyer",
                            "timeStart": "10:30 am",
                            "timeEnd": "1:00 pm",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": []
                        },
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p></p>",
                                    "name": "Sam Laing",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Sam_ATD.jpg"
                                },
                                {
                                    "about": "<p>I currently work at Jumo as an Agile Lead and as a volunteer committee member for Scrum User Group South Africa (SUGSA). I think the most amazing thing about me is that I became a scrum master by “accident” but now I can’t imagine doing anything else. I really love finding new ways to encourage collaboration and transparency and hope to always learn new things.</p><br><p></p>",
                                    "name": "Jay-Allen Morris",
                                    "priority": 1,
                                    "profilePic": "img/speakers/JAY-ALLEN-MORRIS-1.jpg"
                                }
                            ],
                            "description": "<p>Sometimes it can feel as if we do retrospectives just because it’s “the agile thing to do” and occasionally, feel as if they have lost their value and purpose or have become boring. This is a 90 minute interactive session where we will explore together the importance of the 5 phases of retrospectives by participating in one. Instead of learning how to do a retrospective through theory, participants will learn by doing. This session is aimed and inexperienced and experienced scrum masters, facilitators or anyone involved in facilitating retrospectives. You’re welcome to join even if you just want to play with lego and learn something new.</p><br><p></p>",
                            "name": "Workshop: Building Blocks for Effective Retrospectives",
                            "locationId": "boundary-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Sam Laing",
                                "Jay-Allen Morris"
                            ]
                        },
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Pavel Dabrytski is an agile coach and trainer from South Africa. He helps organizations implement Agile sustainably through mentoring, training, and coaching. Over the past years, Pavel worked with major financial organizations and retail giants improving their organisational processes. He also helped organise multiple international conferences in Cape Town and Johannesburg. Pavel is a seasoned presenter who spoke at events in Paris, Prague, Shanghai, Bangalore, Atlanta, New York, Singapore, Orlando as well as in South Africa. Currently, he explores topics on coaching psychology and financial models behind Agile projects.</p><br><p></p>",
                                    "name": "Pavel Dabrytski",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Pavel.jpg"
                                }
                            ],
                            "description": "<p>In October 2016 I received a call, “Hey dude, I don’t know nothing about Agile, but I need to become an Agile coach a-s-a-p – my company just got a new contract.” I laughed for a second, explained that it takes a bit longer than a week to learn to coach, and wished him luck. I also knew that, shortly, he would be walking into his customer’s office in this new role.</p><br><p>Agile Coach is the new black! But how can you, a good coach, stand out from the crowd of less competent peers? Let me offer you this workshop to explore the science of coaching and the ways in which it works. We start with concepts of neuroplasticity and the brain processes of creating new neuron pathways. Then we move to motivation and learn which type is the best. Finally, we finish with the discussion on brain activation states which we practice in a few short exercises. By understanding the new field of coaching psychology, you will become a better practitioner.</p><br><p>I am an affiliate member of the Institute of Coaching at McLean Hospital, the Harvard Medical School affiliate. I studied coaching psychology at Harvard Extension School.</p><br><p></p>",
                            "name": "Workshop: Psychology of Coaching: Understanding Science of Change",
                            "locationId": "gala-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Pavel Dabrytski"
                            ]
                        },
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>As the head of the agility@IQ offering at IQ Business since 2012, I have built an amazing team of Agile consultants (largest in South Africa) that share a common purpose of continuous learning and</p><br><p></p>",
                                    "name": "Biase De Gregorio",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Biase-De-Gregorio-7.jpg"
                                }
                            ],
                            "description": "<p>How are we really doing in South Africa with regards to Agile adoption and maturity of Agile with a focus on large organisations that are all going through this fundamental change?</p><br><p>Over the last 7 years of being involved in Agile adoptions in South Africa, primarily, at large financial services organisations, I have observed several trends that have made the adoption of Agile particularly challenging. The challenges can be summarised as follows:\n• Lack of business engagement – most Agile adoptions are driven by the IT organisation and leave business and operations behind\n• Program execution – at a team level, Agile works well, however, when large programmes of execution are required, how do we manage the delivery\n• Team delivery – Ensuring that the team delivering the value is provided with the necessary constraints, conditions and purpose\n• Lack of systems thinking – extending agility to all the supporting functions in the organisation (e.g.) Finance, Procurement, Facilities, Human resources etc\n• Lack of people Change management – the biggest challenge typically is that Agile adoptions are mandated from executives to deliver the promise of Agile, however, leaders underestimate the impact that it has on the people</p><br><p>As a result of these assumptions, we conducted the first Agile Index South Africa which was to validate these observations through a quantitative survey as well as interviews with key leaders in these organisations based on their experiences.</p><br><p>The talk is aimed leaders and individuals that are currently on or starting an Agile adoption by discussing each of these challenges identified and validated (or NOT) through the research as well as providing some options in addressing these challenges.</p><br><p>Note: the research is ongoing at present and therefore, the challenges identified above may change</p><br><p></p>",
                            "name": "Are we Fragile or are we Agile? Agile adoption in South Africa",
                            "locationId": "ballroom",
                            "timeStart": "10:30 am",
                            "timeEnd": "11:15 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Biase De Gregorio"
                            ]
                        }
                    ]
                },
                {
                    "time": "11:30 am",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Ryan Ripley has worked on agile teams for the past 10 years in development, scrum master and management roles. He’s worked at various fortune 500 companies in the medical device, whole sale, and financial services industries.</p><br><p>Ryan is great at taking tests and holds the PMI-ACP, PSM I, PSM II, PSE, PSPO I, PSD I, CSM, CSPO, CSP, and CAL1 agile certifications.</p><br><p>Ryan lives in Indiana with his wife Kristin and three children. He blogs at ryanripley.com and hosts the Agile for Humans podcast available on iTunes. You can also follow Ryan on twitter: @ryanripley</p><br><p></p>",
                                    "name": "Ryan Ripley",
                                    "priority": 1,
                                    "profilePic": "img/speakers/ryan-ripley.png"
                                }
                            ],
                            "description": "<p>#NoEstimates is a critical look at how estimates are used in the software industry.</p><br><p>When will you deliver that feature? How much will this project cost? Which features can I have in 4 weeks? All reasonable questions that both management and customers want addressed. Traditionally, we’ve used estimates to provide such answer.</p><br><p>The problem: estimates can turn in to commitments, dollars get spent based on misinformation, features end up misaligned with business needs, and all parties involved end up feeling misled and frustrated.</p><br><p>The key question is: Can we still make decisions without traditional estimates?</p><br><p>To answer this question, we will explore how teams can use #NoEstimates thinking to meet the needs of their stakeholders, how to maintain alignment without estimates, and pragmatic ways to move the focus from estimates to metrics and measures that enable teams to deliver high quality products that delight their customers.</p><br><p></p>",
                            "name": "The NoEstimates Movement",
                            "locationId": "ballroom",
                            "timeStart": "11:30 am",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Ryan Ripley"
                            ]
                        }
                    ]
                },
                {
                    "time": "1:15 pm",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I am a technical programme director on Standard Bank’s Core Banking Transformation Programme. I’m deeply interested in large-scale tranformation programmes that have a societal impact. The agile transformation which we are busy with at Standard Bank has reenergised my career and I have become passionate about what agile means for organisations and the people within them.</p><br><p></p>",
                                    "name": "Jeff Lopes",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Jeff.jpg"
                                },
                                {
                                    "about": "<p></p>",
                                    "name": "Shane Ferley",
                                    "priority": 1,
                                    "profilePic": "img/speakers/shane.jpg"
                                }
                            ],
                            "description": "<p>The idea that you cannot use agile work methods and soft systems engineering approaches on large programmes is flawed. In fact, the thinking that you should use traditional hard systems approaches, such as waterfall methods, on large IT implementations is flawed. There is no shortage of articles and studies which depict the dismal track record of large IT programmes. Large core banking system replacements fall into this category and have typically been said to be too large and complex to use agile methodologies. My view on this has changed over the last eighteen months. This is as a result of applying agile work methods on a large core banking programme. In this talk we will describe how we turned a challenged R18 billion programme around.</p><br><p></p>",
                            "name": "Agile Transformation meets Core Banking Transformation",
                            "locationId": "ballroom",
                            "timeStart": "1:15 pm",
                            "timeEnd": "2:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Jeff Lopes",
                                "Shane Ferley"
                            ]
                        },
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Testing is not just a career to me, it is a massive part of who I am. I have been blessed to come across people who have inspired me and taught me and I believe I have been that person to others over the years. The learning never stops though, and I continue to practice the craft and apply learnings from other disciplines back into software testing.</p><br><p>I am at my happiest when I see a team able to do their best testing work and add valuable information into the system. One way I like to do this is to be part of the team. Mentoring and coaching the team from an external viewpoint is also something I am comfortable with. I realise that much of the work we do is heavily influenced by the greater system we are in. I have many years experience of making these things visible and coming up with practical ideas to maximize the value derived from the testing efforts.</p><br><p>Building the craft and community of testing in South Africa is also a passion of mine. To this end, I am the co-organiser of Let’s Test South Africa and the founder and co-organiser of the Joburg Software Testers Meetup.</p><br><p>I enjoy speaking at conferences and have spoken at Let’s Test in Sweden, Copenhagen Context and CAST in North America and I was the co-program chair for CAST 2013.</p><br><p>As Director and Consultant at House of Test South Africa, I am hoping to continue working with awesome people, partnering with friends whom I respect and working my butt off to promote $hit HoT testing.</p><br><p></p>",
                                    "name": "Louise Perold",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>Have you ever heard of exploratory testing? Have you wondered how this approach works? Or how to organise it better?</p><br><p>During this workshop, we will be performing exploratory testing!\nWe will be brainstorming using Ed De Bono’s 6 thinking hats technique (http://www.debonogroup.com/six_thinking_hats.php), to help us identify a variety of questions that we want to answer about the application. We will then use the questions to define test charters and perform exploratory testing based on those charters.</p><br><p>The goal of the session is to give people a feeling for how exploratory testing can be organised, how to provide useful feedback and also how to use the 6 hat thinking technique as an example of how we can plan and prioritise our testing sessions.</p><br><p></p>",
                            "name": "Workshop: Exploratory Testing Workshop using 6 hat thinking!",
                            "locationId": "boundary-room",
                            "timeStart": "1:15 pm",
                            "timeEnd": "2:45 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Louise Perold"
                            ]
                        },
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I exist in a world of creative people, disruptive technologies and innovation, with a software engineering background from and an extensive working career, I ultimately still help organizations fail fast and learn!\nI’m a Software Engineering Manager at ABSA, I’m involved in the DevOps transformation journey and assist teams to adopt new ways of working. I also coach Lean/Agile principles, the value of DevOps, DevOps Culture and Software Engineering Principles. I previously worked extensively as an Agile Coach and Scrum Master helping teams deliver valuable software.\nI’m inspired by people and product teams that make awesome software for their customers, I’m excited to share my journey and learning to the rest of Chef\ncommunity.</p><br><p></p>",
                                    "name": "Benjamin Hinson",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>There is one thing that makes up DevOps. Tools. Tools and process. Okay two things. Tools, process and culture. Among the things that make up DevOps, tools, process and culture are three. And of course, nobody expects the Spanish Inquisition, which makes it tough to get teams to buy into new ways of doing things. So how/where do you begin? allow me to lead you on a journey called the DevOps Acceleration journey where we will learn, share and discover new ways of working and set your teams on a trajectory to success.</p><br><p></p>",
                            "name": "Workshop: Dev-Ops Acceleration Workshop",
                            "locationId": "foyer",
                            "timeStart": "1:15 pm",
                            "timeEnd": "2:45 pm",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": [
                                "Benjamin Hinson"
                            ]
                        },
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Prior to becoming a consultant, I worked in the business process outsourcing industry where I pursued ways to make businesses more effective, more efficient and more capable of adapting to an ever-changing environment. So when I was introduced to Agile a few years later, it was a perfect fit! I now devote my time to anything related to business agility.</p><br><p></p>",
                                    "name": "Angie Doyle",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Angie-Doyle-profile-pic.jpg"
                                },
                                {
                                    "about": "<p>I have always been a “compulsive note-taker”. In meetings, training and conferences I have always used this as a way to concentrate and understand certain topics. Over the years this doodling has evolved into more of a visual note-taking technique, or sketchnoting. I love that this form of note-taking activates the four modes of learning: audio, read-write, visual and kinaesthetic / movement. Thus people reading them will hopefully remember the presentations more vividly, and those who missed it have access to some of the ideas. The skill of visual thinking has helped me add value as a Scrum Master, which is my profession in the Agility team at IQ Business, and whenever I get a chance I am a Sketchnoter…</p><br><p></p>",
                                    "name": "Talia Lancaster",
                                    "priority": 1,
                                    "profilePic": "img/speakers/TaliaLancaster.jpg"
                                }
                            ],
                            "description": "<p>People are unique in their ability to communicate abstract concepts using symbols and language. After all, that is where the saying “a picture is worth a thousand words” comes from. So it shouldn’t come as a surprise that expressing yourself visually (as well as verbally) improves the likelihood that others will not only understand what you are trying to say but also retain the message. A picture has a way of showing ideas and solutions that would have remained hidden if you hadn’t picked up a pen. But a good picture doesn’t eliminate the need for words. It just reduces the number of words we use, so that the ones left behind are the most important…</p><br><p>So why is thinking visually so important?</p><br><p>When working in complex environments and trying to influence change in the workplace, it is essential that we are equipped with the knowledge and tools to tap into different styles of learning. Recent studies show that 65% of people learn and retain information more effectively by seeing words, as well as images. In contrast, only 30% of people learn through verbal communication alone. So if you aren’t one of the 65% of visual learners, someone in your team probably is!</p><br><p>Luckily, you don’t need to be an artist to think visually! Join us as we co-create a visual vocabulary you can practically apply at work or in your personal capacity (during studying and learning). We will take you through the elements essential for visual thinking, as well as some ideas for visualizing concepts. No PowerPoint slides allowed!</p><br><p>This session is for anyone who needs to innovate, invent, analyze, come up with solutions, ideate, solve problems, retain information and build up their confidence to pick up a pen.</p><br><p></p>",
                            "name": "Workshop: Sketching outside the box – Visual thinking for teams",
                            "locationId": "gala-room",
                            "timeStart": "1:15 pm",
                            "timeEnd": "2:45 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Angie Doyle",
                                "Talia Lancaster"
                            ]
                        }
                    ]
                },
                {
                    "time": "2:00 pm",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>With more than eighteen years of project delivery experience, Faye Thompson, JD, PSM1, is a senior agile consultant with CareWorks Tech. Focusing on agile methodologies and continuous improvement, she has had a positive impact in the financial services, healthcare, advertising, and automotive industries. Passionate about using innovative solutions to drive business value, Faye helps workgroups transform into highly engaged and energized teams. She enjoys serving on the board of directors for the Central Ohio Agile Association, volunteering as an instructor and emergency medical responder for the American Red Cross, and spending time with her husband and two dogs.</p><br><p></p>",
                                    "name": "Faye Thompson",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Faye-Thompson.jpg"
                                }
                            ],
                            "description": "<p>Humans process millions of bits of information each day. In order to handle that data load, our brains have developed shortcuts to take advantage of patterns, shared knowledge and experience. Unfortunately, sometimes those short cuts lead us astray, and cause us to draw inaccurate conclusions. These cognitive biases are amplified when you pull together a team of people all trying to work together. Come learn about some of the most common types of biases and how to recognize when they are negatively impacting your team. We will also practice some techniques for working around their impacts.</p><br><p></p>",
                            "name": "It’s All In Our Heads: How Neuroscience Can Help Us Create High-Performing Teams",
                            "locationId": "ballroom",
                            "timeStart": "2:00 pm",
                            "timeEnd": "2:45 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Faye Thompson"
                            ]
                        }
                    ]
                },
                {
                    "time": "3:00 pm",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Oded Tamir – an Agile Lead Coach and certified SPC4 (SAFe Program Consultant) at Agilesparks (www.agilesparks.com), Israel Supporting Agile transition in large global enterprises\nMy first experience in Agile implementation in 2006 became my main professional engagement during the last three years.\nFor over 20 years, I held various executive roles- CIO, Project Management in the High-Tech industry, including the position of VP Project Management in a large global company- where I focused on project tracking, problem- solving and crisis management.\nAlthough I have successfully implemented “crisis solving” processes that saved the company millions of dollars, I found that traditional project management has limited tools to solve problems and so the way back to Agile was only a matter of time.\n2014 was the next breakthrough in my career when I joined Agilesparks.\nSince then, I support Agile and DevOps change journey in large global technological projects supporting distributed teams across the globe (Israel, USA, India, Argentina, Ukraine, Moldova and more) as well as in IT departments of financial institutions.\nMoving from adopting Agile in teams to fully adopting it across the organization is challenging for organizations.\nAs an Agile Lead coach and SPC, I am sure that with knowledge, experience and practices we can move large enterprises to be much more Agile in the way they act in the market and manage people.\nI believe that Learning and sharing knowledge is an inherent part of my role as Agile coach. Therefore, I used to attend Agile conferences across the globe (Agile Prague, Agile Singapore, Agile Israel) and joint workshops (Value Stream workshops in Toyota Japan) as an attendee as well as a lecturer.</p><br><p></p>",
                                    "name": "Oded Tamir",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Oded.jpg"
                                }
                            ],
                            "description": "<p>Why You Must Slow Down in order to get Faster\nHow to handle Bottlenecks, create Flow and improve performance in your Agile Project.</p><br><p>“The Blue Pill or the Red Pill? – Choose your Pill” was the famous question in “The Matrix” movie.\nTaking the “red-pill” refers to a human who chooses to be aware of reality and the true nature of the world.\nAnd the question that this presentation is going to discuss is whether you are ready to take the “Red Pill” and consequently become aware that “Slowing Down” is the right step that will help you to move your organization much faster?\nSlowing Down is not an easy step for managers that were educated for years to optimize their organization business unit and to maximize their capacity and production capabilities.\nSlowing down looks like opposite of all they learned in MBA studies.\nAs Stephen Denning said in his book: “We know it- math quantifies it and experiments confirm it But we still have hard time believing it’s true” (The Leader’s Guide for Radical Management)\n“Theory of Constraint” and “System Thinking” even gave managers tools to implement that:\nAs W. Edwards Deming says: “Management’s job is to optimize the whole system”\nThe presentation will use a ‘phantom’ traffic jam and the traffic jam nature in order to help us better understand the behavior of organizational bottlenecks and why the “opposite way” of slowing down will help organizations improve performance and become much faster.\nAgile implementation and the related change process established new kinds of organization bottlenecks mainly in the product discovery (backlog preparation) and the testing efforts, both require solutions by managers.\nUsing the “shift Left” approach, implementing practices like ATDD will help agile teams and managers to improve both of the above bottlenecks.\nThe presentation will discuss practices that will help managers to analyze bottlenecks in the project and the right ways to handle them.\nAwareness and understanding of the management paradigm will help them take the “Red Pill” and adopt the concept of “Slowing Down in order to get faster”.</p><br><p></p>",
                            "name": "Why You Must Slow Down in order to get Faster: How to handle Bottlenecks, create Flow and improve performance in your Agile Project",
                            "locationId": "ballroom",
                            "timeStart": "3:00 pm",
                            "timeEnd": "3:45 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Oded Tamir"
                            ]
                        },
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>I write software and lead a team of great developers at Investec. I like to leave it all on the dancefloor. I was once a guy who did a poem where the audience snapped fingers instead of clapping. Now I’m married with two kids. This presentation is my last chance at the big time.</p><br><p></p>",
                                    "name": "Sizwe Mabanga",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Sizwe.jpg"
                                }
                            ],
                            "description": "<p>Well. It’s a full forty five minutes of me bringing together my favourite abstractions, taking care to entertain and perhaps even thrill where permitted.</p><br><p>Thou shalt have no questions.</p><br><p>The concepts covered will include:\nThe battle-lines of organisational entropy.\nThe Conversation (as auxiliary to The Method).\nChomskyism and Semantic Agility.</p><br><p>With these and more I wish to tell a compelling new story about us that introduces new ways for us to see and speak about ourselves.</p><br><p></p>",
                            "name": "Useful abstractions in the quest for agility",
                            "locationId": "gala-room",
                            "timeStart": "3:00 pm",
                            "timeEnd": "3:45 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Sizwe Mabanga"
                            ]
                        }
                    ]
                },
                {
                    "time": "4:00 pm",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p>Meet The Man in the Black Shirt. Donovan Brown is a Principal DevOps Manager on Microsoft’s Cloud Developer Advocacy team. Why is DevOps one of the hottest topics? Because it hurts the most. Luckily, Donovan’s unofficial tag line is #RubDevOpsOnIt and he’s here to make it all better. Before joining Microsoft, Donovan spent seven years as a Process Consultant and a Certified Scrum Master. Developer Tools are his thing. Donovan has travelled the globe helping companies in the U.S., Canada, India, Germany, and the UK develop solutions using agile practices, Visual Studio, and Team Foundation Server in industries as broad as Communications, Health Care, Energy, and Financial Services. What else keeps the wheels spinning on The Man in The Black Shirt? Donovan’s also an avid programmer, often finding ways to integrate software into his other hobbies and activities, one of which is Professional Air Hockey where he has ranked as high as 11 in the world.</p><br><p></p>",
                                    "name": "Donovan Brown",
                                    "priority": 1,
                                    "profilePic": "img/speakers/donovan-brown.png"
                                }
                            ],
                            "description": "<p>Hear how Microsoft embarked on their own DevOps journey reducing a three-year release cycle down to three weeks. Donovan Brown, a Principal DevOps Manager on the US Developer Division team in Microsoft, shares how they managed to make an Agile Transformation that scaled to support business needs.</p><br><p></p>",
                            "name": "Microsoft’s Agile Transformation Story",
                            "locationId": "ballroom",
                            "timeStart": "4:00 pm",
                            "timeEnd": "4:45 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Donovan Brown"
                            ]
                        }
                    ]
                },
                {
                    "time": "4:45 pm",
                    "sessions": [
                        {
                            "date": "22nd August 2017",
                            "speakers": [
                                {
                                    "about": "<p></p>",
                                    "name": "Alok Goswami",
                                    "priority": 1
                                },
                                {
                                    "about": "<p></p>",
                                    "name": "Joanne Perold",
                                    "priority": 1
                                },
                                {
                                    "about": "<p></p>",
                                    "name": "Barry Dwolatzky",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Prof-Barry-Dwolatzky-small.jpg"
                                }
                            ],
                            "description": "<p></p>",
                            "name": "Closing and prize draw",
                            "locationId": "ballroom",
                            "timeStart": "4:45 pm",
                            "timeEnd": "5:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Alok Goswami",
                                "Joanne Perold",
                                "Barry Dwolatzky"
                            ]
                        }
                    ]
                }
            ]
        }
    ],
    "speakers": [
        {
            "name": "Kent Beck",
            "profilePic": "http://2017.agileafricaconf.com/wp-content/uploads/2017/06/kent-beck.jpg",
            "about": "<p>Programming coach at Facebook, singer/guitarist, peripatetic. Learning to be me.</p>",
            "priority": 0,
            "twitter": "@kentbeck"
        },
        {
            "about": "<p></p>",
            "name": "Alok Goswami",
            "priority": 1
        },
        {
            "about": "<p></p>",
            "name": "Joanne Perold",
            "priority": 1,
            "twitter": "@joPerold"
        },
        {
            "about": "<p></p>",
            "name": "Barry Dwolatzky",
            "priority": 1,
            "profilePic": "http://2017.agileafricaconf.com/wp-content/uploads/2017/06/Prof-Barry-Dwolatzky-small.jpg",
            "twitter": "@BarryDwolatzky"
        },
        {
            "about": "<p>Meet The Man in the Black Shirt. Donovan Brown is a Principal DevOps Manager on Microsoft’s Cloud Developer Advocacy team. Why is DevOps one of the hottest topics? Because it hurts the most. Luckily, Donovan’s unofficial tag line is #RubDevOpsOnIt and he’s here to make it all better. Before joining Microsoft, Donovan spent seven years as a Process Consultant and a Certified Scrum Master. Developer Tools are his thing. Donovan has travelled the globe helping companies in the U.S., Canada, India, Germany, and the UK develop solutions using agile practices, Visual Studio, and Team Foundation Server in industries as broad as Communications, Health Care, Energy, and Financial Services. What else keeps the wheels spinning on The Man in The Black Shirt? Donovan’s also an avid programmer, often finding ways to integrate software into his other hobbies and activities, one of which is Professional Air Hockey where he has ranked as high as 11 in the world.</p><br><p></p>",
            "name": "Donovan Brown",
            "twitter": "@DonovanBrown",
            "priority": 1,
            "profilePic": "img/speakers/donovan-brown.png"
        },
        {
            "about": "<p>Oded Tamir – an Agile Lead Coach and certified SPC4 (SAFe Program Consultant) at Agilesparks (www.agilesparks.com), Israel Supporting Agile transition in large global enterprises\nMy first experience in Agile implementation in 2006 became my main professional engagement during the last three years.\nFor over 20 years, I held various executive roles- CIO, Project Management in the High-Tech industry, including the position of VP Project Management in a large global company- where I focused on project tracking, problem- solving and crisis management.\nAlthough I have successfully implemented “crisis solving” processes that saved the company millions of dollars, I found that traditional project management has limited tools to solve problems and so the way back to Agile was only a matter of time.\n2014 was the next breakthrough in my career when I joined Agilesparks.\nSince then, I support Agile and DevOps change journey in large global technological projects supporting distributed teams across the globe (Israel, USA, India, Argentina, Ukraine, Moldova and more) as well as in IT departments of financial institutions.\nMoving from adopting Agile in teams to fully adopting it across the organization is challenging for organizations.\nAs an Agile Lead coach and SPC, I am sure that with knowledge, experience and practices we can move large enterprises to be much more Agile in the way they act in the market and manage people.\nI believe that Learning and sharing knowledge is an inherent part of my role as Agile coach. Therefore, I used to attend Agile conferences across the globe (Agile Prague, Agile Singapore, Agile Israel) and joint workshops (Value Stream workshops in Toyota Japan) as an attendee as well as a lecturer.</p><br><p></p>",
            "name": "Oded Tamir",
            "priority": 1,
            "profilePic": "img/speakers/Oded.jpg",
            "twitter": "@oded_tamir"
        },
        {
            "about": "<p>I write software and lead a team of great developers at Investec. I like to leave it all on the dancefloor. I was once a guy who did a poem where the audience snapped fingers instead of clapping. Now I’m married with two kids. This presentation is my last chance at the big time.</p><br><p></p>",
            "name": "Sizwe Mabanga",
            "priority": 1,
            "profilePic": "img/speakers/Sizwe.jpg",
            "twitter": "@sizwethekingrat"
        },
        {
            "about": "<p>With more than eighteen years of project delivery experience, Faye Thompson, JD, PSM1, is a senior agile consultant with CareWorks Tech. Focusing on agile methodologies and continuous improvement, she has had a positive impact in the financial services, healthcare, advertising, and automotive industries. Passionate about using innovative solutions to drive business value, Faye helps workgroups transform into highly engaged and energized teams. She enjoys serving on the board of directors for the Central Ohio Agile Association, volunteering as an instructor and emergency medical responder for the American Red Cross, and spending time with her husband and two dogs.</p><br><p></p>",
            "name": "Faye Thompson",
            "priority": 1,
            "profilePic": "img/speakers/Faye-Thompson.jpg",
            "twitter": "@AgileFaye"
        },
        {
            "about": "<p>I am a technical programme director on Standard Bank’s Core Banking Transformation Programme. I’m deeply interested in large-scale tranformation programmes that have a societal impact. The agile transformation which we are busy with at Standard Bank has reenergised my career and I have become passionate about what agile means for organisations and the people within them.</p><br><p></p>",
            "name": "Jeff Lopes",
            "priority": 1,
            "profilePic": "img/speakers/Jeff.jpg"
        },
        {
            "about": "<p></p>",
            "name": "Shane Ferley",
            "priority": 1,
            "profilePic": "img/speakers/shane.jpg"
        },
        {
            "about": "<p>Testing is not just a career to me, it is a massive part of who I am. I have been blessed to come across people who have inspired me and taught me and I believe I have been that person to others over the years. The learning never stops though, and I continue to practice the craft and apply learnings from other disciplines back into software testing.</p><br><p>I am at my happiest when I see a team able to do their best testing work and add valuable information into the system. One way I like to do this is to be part of the team. Mentoring and coaching the team from an external viewpoint is also something I am comfortable with. I realise that much of the work we do is heavily influenced by the greater system we are in. I have many years experience of making these things visible and coming up with practical ideas to maximize the value derived from the testing efforts.</p><br><p>Building the craft and community of testing in South Africa is also a passion of mine. To this end, I am the co-organiser of Let’s Test South Africa and the founder and co-organiser of the Joburg Software Testers Meetup.</p><br><p>I enjoy speaking at conferences and have spoken at Let’s Test in Sweden, Copenhagen Context and CAST in North America and I was the co-program chair for CAST 2013.</p><br><p>As Director and Consultant at House of Test South Africa, I am hoping to continue working with awesome people, partnering with friends whom I respect and working my butt off to promote $hit HoT testing.</p><br><p></p>",
            "name": "Louise Perold",
            "priority": 1,
            "twitter": "@lperold"
        },
        {
            "about": "<p>I exist in a world of creative people, disruptive technologies and innovation, with a software engineering background from and an extensive working career, I ultimately still help organizations fail fast and learn!\nI’m a Software Engineering Manager at ABSA, I’m involved in the DevOps transformation journey and assist teams to adopt new ways of working. I also coach Lean/Agile principles, the value of DevOps, DevOps Culture and Software Engineering Principles. I previously worked extensively as an Agile Coach and Scrum Master helping teams deliver valuable software.\nI’m inspired by people and product teams that make awesome software for their customers, I’m excited to share my journey and learning to the rest of Chef\ncommunity.</p><br><p></p>",
            "name": "Benjamin Hinson",
            "priority": 1,
            "twitter": "@Benj_Hin"
        },
        {
            "about": "<p>Prior to becoming a consultant, I worked in the business process outsourcing industry where I pursued ways to make businesses more effective, more efficient and more capable of adapting to an ever-changing environment. So when I was introduced to Agile a few years later, it was a perfect fit! I now devote my time to anything related to business agility.</p><br><p></p>",
            "name": "Angie Doyle",
            "priority": 1,
            "profilePic": "img/speakers/Angie-Doyle-profile-pic.jpg",
            "twitter": "@Doyle_Angie"
        },
        {
            "about": "<p>I have always been a “compulsive note-taker”. In meetings, training and conferences I have always used this as a way to concentrate and understand certain topics. Over the years this doodling has evolved into more of a visual note-taking technique, or sketchnoting. I love that this form of note-taking activates the four modes of learning: audio, read-write, visual and kinaesthetic / movement. Thus people reading them will hopefully remember the presentations more vividly, and those who missed it have access to some of the ideas. The skill of visual thinking has helped me add value as a Scrum Master, which is my profession in the Agility team at IQ Business, and whenever I get a chance I am a Sketchnoter…</p><br><p></p>",
            "name": "Talia Lancaster",
            "priority": 1,
            "profilePic": "img/speakers/TaliaLancaster.jpg",
            "twitter": "@lancaster_talia"
        },
        {
            "about": "<p>Ryan Ripley has worked on agile teams for the past 10 years in development, scrum master and management roles. He’s worked at various fortune 500 companies in the medical device, whole sale, and financial services industries.</p><br><p>Ryan is great at taking tests and holds the PMI-ACP, PSM I, PSM II, PSE, PSPO I, PSD I, CSM, CSPO, CSP, and CAL1 agile certifications.</p><br><p>Ryan lives in Indiana with his wife Kristin and three children. He blogs at ryanripley.com and hosts the Agile for Humans podcast available on iTunes. You can also follow Ryan on twitter: @ryanripley</p><br><p></p>",
            "name": "Ryan Ripley",
            "priority": 1,
            "profilePic": "img/speakers/ryan-ripley.png",
            "twitter": "@ryanripley"
        },
        {
            "about": "<p></p>",
            "name": "Sam Laing",
            "priority": 1,
            "profilePic": "img/speakers/Sam_ATD.jpg",
            "twitter": "@samlaing"
        },
        {
            "about": "<p>I currently work at Jumo as an Agile Lead and as a volunteer committee member for Scrum User Group South Africa (SUGSA). I think the most amazing thing about me is that I became a scrum master by “accident” but now I can’t imagine doing anything else. I really love finding new ways to encourage collaboration and transparency and hope to always learn new things.</p><br><p></p>",
            "name": "Jay-Allen Morris",
            "priority": 1,
            "profilePic": "img/speakers/JAY-ALLEN-MORRIS-1.jpg",
            "twitter": "@JayAllenM"
        },
        {
            "about": "<p>Pavel Dabrytski is an agile coach and trainer from South Africa. He helps organizations implement Agile sustainably through mentoring, training, and coaching. Over the past years, Pavel worked with major financial organizations and retail giants improving their organisational processes. He also helped organise multiple international conferences in Cape Town and Johannesburg. Pavel is a seasoned presenter who spoke at events in Paris, Prague, Shanghai, Bangalore, Atlanta, New York, Singapore, Orlando as well as in South Africa. Currently, he explores topics on coaching psychology and financial models behind Agile projects.</p><br><p></p>",
            "name": "Pavel Dabrytski",
            "priority": 1,
            "profilePic": "img/speakers/Pavel.jpg",
            "twitter": "@PavelDabrytski"
        },
        {
            "about": "<p>As the head of the agility@IQ offering at IQ Business since 2012, I have built an amazing team of Agile consultants (largest in South Africa) that share a common purpose of continuous learning and</p><br><p></p>",
            "name": "Biase De Gregorio",
            "priority": 1,
            "profilePic": "img/speakers/Biase-De-Gregorio-7.jpg",
            "twitter": "@biased77"
        },
        {
            "about": "<p>Building the right software product in the right way is my passion. Working with teams and being part of a team that is building solutions that our users actually want or need is my commitment.\nI have 5 years of experience working in Agile teams across the banking and insurance industry in South Africa and Australia.\nI started my career as an agile business analyst then started doing a combination of BA and Iteration management. I majored in computer science and economics at the University of Witwatersrand. I currently work for a software consultancy called Khabane Majestic Consulting</p><br><p></p>",
            "name": "Liandra Bassiane",
            "priority": 1,
            "profilePic": "img/speakers/liandre.jpg",
            "twitter": "@liandrabassiane"
        },
        {
            "about": "<p>Rouan Wilsenach is a software developer. He has built applications in a variety of technology stacks for companies in the financial services, education, health and media sectors. He’s worked as a consultant and coach, helping teams learn good engineering practices and helping businesses transform the way they build software. He now works remotely for Tes, where he builds full-stack JavaScript microservices to help teachers and schools.</p><br><p></p>",
            "name": "Rouan Wilsenach",
            "priority": 1,
            "profilePic": "img/speakers/Rouan.jpg",
            "twitter": "@rouanw"
        },
        {
            "about": "<p>Travis is the Agile Practice Manager at Chillisoft. He has spent the last 11 years traveling and working around the world in various countries.\nHe is passionate about software quality management, craftsmanship and leadership.\nHe serves on the board of Open Data Durban, a non-profit civic technology lab and is an active member of the Durban software development community.</p><br><p></p>",
            "name": "Travis Frisinger",
            "priority": 1,
            "twitter": "@tmfrisinger",
            "profilePic": "https://pbs.twimg.com/profile_images/636934047734857729/wDNnzOn5_400x400.jpg"
        },
        {
            "about": "<p>My corporate role is as an Agile Coach within Standard Bank, however my focus and passion is more towards shifting mental models and how people show up so that they actively support and generate Agility (with detours to Kanban and visualisation – if you can’t see it (behaviour included), you seldom talk about it or change it). My goal is to find ways to find ways to generate tools that allow us as Agile coaches to practically and effectively engage with behaviour that often gets in the way of adopting Agile.\nI both facilitate this on our internal Servant Leadership labs as well as coach this as a new way of behaving in stand up’s, other ceremonies and one-on-one coaching sessions that allow individuals to explore their mindsets.\nMy passion for understanding and shifting mind-sets and behaviour started when I was able to shift my own thinking and so acquire the Guinness World Record for the Deepest Dive by a woman.</p><br><p></p>",
            "name": "Verna van Schaik",
            "priority": 1,
            "profilePic": "img/speakers/Verna2017.jpg"
        },
        {
            "about": "<p>I am a father and a husband with a passion for reading, MMA, English football and science fiction. I refer to myself as recovering traditional leader with a focus on developing high performing people,teams and organisation’s. Having spent the last 15 years in financial technology in Africa and have had the privilege of having a diverse career leading departments across  networks, distributed technologies, end user technologies within 12 African countries which has exposed me to all facets of a large enterprise. In the last few years I have been focused on business strategy and leadership and through my current role as the head of Agile transformation and strategy, have been driving a new way of thinking and radical management within my organisation. I received my MBA from GIBS with a specialisation in people and basic psychological needs within the workplace providing me a better understanding into intrinsic motivation and how to structure organisation’s to support the right culture.</p><br><p></p>",
            "name": "James Knupfer",
            "priority": 1
        },
        {
            "about": "<p>Joshua is an experienced Agile and Developer coach. He also lectures part-time at a post-graduate level.</p><br><p></p>",
            "name": "Joshua Lewis",
            "priority": 1,
            "profilePic": "img/speakers/Josh.jpg",
            "twitter": "@joshilewis"
        },
        {
            "about": "<p>Sonja partners with leaders and other practitioners to enable responsive and agile organisations and make sense of complex problems like culture and change. She does this through the use of pioneering ideas and tools from complexity theory and narrative practice. Her expertise lies in enabling environments in organisations where thinking and behaviour shifts toward greater strategic agility and resilience. Focus areas include: enabling change resilience; effective strategy execution; devolved decision-making; sense-making; and culture.</p><br><p>Sonja has over 15 years experience consulting locally and internationally. Prior to founding More Beyond, she consulted for PWC and IBM. She is the exclusive South African partner for Prof Dave Snowden’s company Cognitive Edge and supplies training in their open source methods; the Cynefin sense-making framework as well as the Sensemaker software suite.</p><br><p></p>",
            "name": "Sonja Blignaut",
            "priority": 1,
            "profilePic": "img/speakers/Sonja-sml.jpg"
        },
        {
            "about": "<p>I’m a software engineer and have been professionally involved in software development of mission-critical systems for about 15 years. Most of my experience has been in developing crucial font-end applications in the financial industries: online trading, online banking, insurance and branch banking.</p><br><p></p>",
            "name": "Jacques de Vos",
            "priority": 1,
            "profilePic": "img/speakers/Jacques.jpg",
            "twitter": "@jacdevos"
        },
        {
            "about": "<p>I was a PM, come BA and have since morphed myself into a Scrum master, doing some agile coaching on the side.  I have been a Scrum master for just over 3 years now. I have an Honours degree in Psychology and continue to be fascinated by what makes people tick and am myself on an ongoing journey of self improvement.</p><br><p></p>",
            "name": "Catherine Holland",
            "priority": 1,
            "profilePic": "http://2017.agileafricaconf.com/wp-content/uploads/2017/06/catherine.jpg"
        },
        {
            "about": "<p>Cara is the COO and Agile Coach at Project codeX, a disruptive education initiative that equips aspiring coders with high quality skills and experience, while bridging the digital divide.</p><br><p>Her ultimate goal is for us all to find the work we love doing, and build a better future doing it. Having spent years helping teams adopt agile practices that reduce risk and increase workplace happiness, she now helps aspiring coders to discover and follow their tech passions, on their journey to become agile software developers.</p><br><p>She has an insatiable love of learning, and cares deeply about sharing knowledge to build stronger communities and foster greater diversity in the software world.</p><br><p></p>",
            "name": "Cara Turner",
            "priority": 1,
            "profilePic": "img/speakers/cara-turner.jpg",
            "twitter": "@Cara_Faye"
        },
        {
            "about": "<p>I am a senior quality assurance consultant at Thoughtworks and, since 1999, have specialised in software testing and quality assurance. I believe it offers more opportunities than straight development.</p><br><p>As a result, I’ve had the good fortune to gain exposure to a wide range of remarkable opportunities in South Africa and the United States, being exposed to the concrete elements of best practices across a range of disciplines, assignments, projects, organisations and industries. I am fascinated by the constant change, which ensures there is always something new for me to learn.</p><br><p>In my spare time I run 5km, 10km and half marathon races.</p><br><p></p>",
            "name": "Wayne Sinclair",
            "priority": 1
        },
        {
            "about": "<p>I graduated from WITS with a BSc (Comp Sci) 1991. I have since been working in the software industry on initiatives of many different scales and technologies. Most recently I have had some forays into Enterprise Architecture that have left me questioning what valuable practices actually are. I am currently the CTO and a director of Dariel. Even at this stage of my career I still maintain a passion for the workings “nuts and bolts” and thus maintain my programming competency. I am a firm believer in Lean and Kaizen and the original principles that have since been translated into Agile Software methodologies.</p><br><p></p>",
            "name": "Wayne Yan",
            "priority": 1
        },
        {
            "about": "<p>Yogini is a Scrum Master, aspiring Agile Coach in Barclays Africa (South Africa).\nYogini first encountered Agile in 2014 and has been learning about and doing it\never since. She loves how simple in is to do and benefits can be seen\nimmediately.</p><br><p></p>",
            "name": "Yogini Moodley",
            "priority": 1,
            "twitter": "@yogini_zn"
        },
        {
            "about": "<p>Greg is a member of the BSG Business Analytics team specialising in the role of Business Domain and Business Intelligence.\nGreg has over 12 years of experience in Logistics, Financial Services, Automotive and Mining where he has gained extensive knowledge of agile project delivery in a variety of roles including:\n•         Project manager\n•         Project risk management\n•         Project assurance and compliance\n•         Business analysis\n•         Data & analytics\n•         Business intelligence and reporting</p><br><p></p>",
            "name": "Greg Desilla",
            "priority": 1,
            "profilePic": "img/speakers/Greg-Desilla-email.jpg"
        },
        {
            "about": "<p>Leading the BSG business analytics capability as principal business consultant, Julia strongly believes in the value of deriving business intelligence from data to improve business performance.</p><br><p>Her experience in academia, inventory management, supply chain management, supply chain analytics, business analytics and business intelligence span the motor, retail, logistics, telecommunications and banking sectors.</p><br><p>With a PhD in Mathematical Statistics from the Nelson Mandela Metropolitan University, Julia has delivered a range of business analytics solutions, focused on solving business problems by surfacing the right intelligence to enable fact-based decisions. During the past few years she has focused her career in the field of data science, a natural progression from her statistics roots. Julia is skilled in playing the integration role between business decision makers and their technology service providers.</p><br><p></p>",
            "name": "Julia Keddie",
            "priority": 1,
            "profilePic": "img/speakers/Julia-Keddie-email.jpg"
        },
        {
            "about": "<p>I am a Senior Software Engineer at Dariel with a degree in Electrical Engineering and broad experience across multiple industries. My work previous experience includes application design and development; system integration; and I am currently the Senior Engineer in the design and development of infrastructure automation tool for a major South African bank.</p><br><p>Programming, code and computers have been a huge passion for me from as early as I can remember; and I am currently completing a Masters in Software Engineering. I love working in teams and sharing the things I’ve learned with others. My other interests include playing guitar; Minecraft (with automation, of course); board games; and other computer games. I also enjoy astronomy; camping; hiking; travelling and art.</p><br><p></p>",
            "name": "Geoffrey Lydall",
            "priority": 1
        },
        {
            "about": "<p>Simplifier-in-Chief for KRS software. An early female entrepreneur, with a love of software and people, and how both mix to solve problems.</p><br><p></p>",
            "name": "Lorraine Steyn",
            "priority": 1,
            "profilePic": "img/speakers/Lorraine.jpg",
            "twitter": "@lor_krs"
        },
        {
            "about": "<p>Adam is both the Chief Operating Officer at Platform45 as well as a Product Owner, working with two of their talented teams to design and build beautiful software that matters. Adam loves building the teams that build great product.</p><br><p></p>",
            "name": "Adam Sachs",
            "priority": 1,
            "profilePic": "http://2017.agileafricaconf.com/wp-content/uploads/2017/08/adam.png"
        },
        {
            "about": "<p>Simon is a Technical Product Lead at Platform45, interested in everything software from design & development to machine learning. On his journey, Simon loves sharing his learnings, and has given a couple talks in South Africa and the USA. Catch him on Github (@sighmin), or at simonvandyk.co.za.</p><br><p></p>",
            "name": "Simon van Dyk",
            "priority": 1,
            "profilePic": "img/speakers/simon.jpg",
            "twitter": "@siefi"
        }
    ],
    "sponsors": [
        {
            "groupName": "Title Sponsor",
            "sponsors": [
                {
                    "name": "JCSE",
                    "imageSrc": "img/sponsors/jcse_logo_rgb-280.gif",
                    "url": "http://www.jcse.org.za/"
                }
            ]
        },
        {
            "groupName": "Diamond Sponsor",
            "sponsors": [
                {
                    "name": "IQ Business",
                    "imageSrc": "img/sponsors/IQBusiness-Logo.png",
                    "url": "http://www.iqbusiness.net/"
                }
            ]
        },
        {
            "groupName": "Gold Sponsors",
            "sponsors": [
                {
                    "name": "Prodigy Finance",
                    "imageSrc": "img/sponsors/Prodigy_LandscapeLogo.jpg",
                    "url": "http://www.prodigyfinance.com/"
                },
                {
                    "name": "Liberty",
                    "imageSrc": "img/sponsors/Liberty.png",
                    "url": "http://www.liberty.co.za/"
                }
            ]
        },
        {
            "groupName": "Silver Sponsors",
            "sponsors": [
                {
                    "name": "nReality",
                    "imageSrc": "img/sponsors/nReality-dark-300x79.png",
                    "url": "http://www.nreality.com/"
                },
                {
                    "name": "Agile 42",
                    "imageSrc": "img/sponsors/Agile42-e1497864739541.png",
                    "url": "http://www.agile42.com/"
                }
            ]
        }
    ],
    "map": [
        {
            "name": "dunno",
            "lat": -33.9353866,
            "lng": 18.4550375,
            "center": true
        }
    ],
    "locationMappings": [
        {
            "name": "Ballroom",
            "id": "ballroom",
            "color": "#6285A0"
        },
        {
            "name": "Gala",
            "id": "gala-room",
            "color": "#866686"
        },
        {
            "name": "Boundary",
            "id": "boundary-room",
            "color": "#D95F62"
        },
        {
            "name": "Foyer",
            "id": "foyer",
            "color": "#4C9689"
        }
    ]
}
