{
    "name": "Agile Africa 2018",
    "description": "Agile Africa 2018",
    "about": {
        "imageSrc": "img/icon.png",
        "heading": "Agile Africa 2018",
        "subHeading": "About the conference",
        "description": "2018 marks the sixth-year anniversary of the Agile Africa conference, and we will build on previous years to create an engaging, memorable event. Our keynotes for the Agile Africa 2018 conference include leading experts of international acclaim. Furthermore, the conference includes a diversity of both local and international speakers, and you will get to interact with and learn from people working in all different environments. ",
        "website": "",
        "feedbackHeading": "Feedback for the conference",
        "feedbackDescription": "Please answer a collection of questions about the conference which will be used to improve your experience next year. This should take around 1-2 minutes of your time. Your feedback will remain anonymous.",
        "questions": [
            {   
                "name": "satisfaction",
                "text": "How satisfied were you with the conference?"
            },
            {   
                "name": "objective",
                "text": "In your opinion, did the conference meet its objectives?"
            },
            {
                "name":"structure",
                "text": "How well was the conference structured?"
            },
            {
                "name":"discussion",
                "text": "Was there enough time for discussion?"
            },
            {
                "name": "topics",
                "text": "Which topics would you like to see covered at future conferences?"
            }
        ],
        "links": [
            {
                "linkText": "Give us feedback!",
                "text": "",
                "link": "https://cloudcallio.typeform.com/to/jiXxOG"
            }
        ]
    },
    "schedule": [
        {
            "date": "1st OCtober 2018",
            "groups": [
                {
                    "time": "7:30 am",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [],
                            "description": "<p></p>",
                            "name": "Lean Coffee",
                            "locationId": "marathon-room",
                            "timeStart": "7:30 am",
                            "timeEnd": "8:30 am",
                            "tracks": [
                                "marathon-room"
                            ],
                            "speakerNames": []
                        }
                    ]
                },
                {
                    "time": "8:00 am",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [],
                            "description": "<p>Please visit the Welcome Desk in the Foyer to register.</p><br><p></p>",
                            "name": "Registration",
                            "locationId": "ballroom",
                            "timeStart": "8:00 am",
                            "timeEnd": "9:00 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": []
                        }
                    ]
                },
                {
                    "time": "9:00 am",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p></p>",
                                    "name": "Oz Chihwayi",
                                    "priority": 1
                                },
                                {
                                    "about": "<p></p>",
                                    "name": "Barry Dwolatzky",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Prof-Barry-Dwolatzky-small.jpg"
                                }
                            ],
                            "description": "<p>Opening Keynote</p>",
                            "name": "Welcome",
                            "locationId": "ballroom",
                            "timeStart": "9:00 am",
                            "timeEnd": "9:15 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Oz Chihwayi",
                                "Barry Dwolatzky"
                            ]
                        }
                    ]
                },
                {
                    "time": "9:15 am",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>Selena Delesie is a leadership and transformation coach, speaker, and author. She is a trusted guide for leaders who seek to improve their business and their life. Selena blends sixteen years of experience in the technology industry with a broad range of studies, to support powerful transformations for individuals, teams, and organizations. The founder of Lead With Love Global and Women Ignited, Selena offers a variety of coaching programs, podcast and virtual leadership conferences. Her clients rave about breaking free from traditional beliefs and practices to engage their strengths and passions—and those around them—for success. Selena is renowned mentor and coach for executives, managers, and teams. She guides & facilitates alignment of vision with strategic goals, transition to empowering work processes, increased productivity and organizational effectiveness.</p><br><p></p>",
                                    "name": "Selena Delesie",
                                    "priority": 1,
                                    "profilePic": ""
                                }
                            ],
                            "description": "<p>We spend too much time focused on doing better. 'Go faster', 'Put more people on the problem', 'Reduce costs', 'Just get it shipped!' Do any of these sound familiar? We excel at fire fighting and bandaid solutions.</p><br><p></p>",
                            "name": "The Soul of Agile",
                            "locationId": "ballroom",
                            "timeStart": "9:15 am",
                            "timeEnd": "10:15 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Selena Delesie"
                            ]
                        }
                    ]
                },
                {
                    "time": "10:30 am",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [],
                            "description": "<p>Lots of conversations and open space stuff happening here , join the fishbowl, have a look at the posters or just have an impromptu conversation.</p><br><p></p>",
                            "name": "Fishbowl - An open space for conversations and discussions",
                            "locationId": "marathon-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "4:00 pm",
                            "tracks": [
                                "foyer"
                            ],
                            "speakerNames": []
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>I am a spirited young woman, feeding on creativity and the things around me. Always thinking and dreaming, I am obsessed with the process of creating something new. With experience in product design, I collaborate within teams to build experiences fit for the humans in the world of corporate banking. I have a keen interest in Inclusive Design because I subscribe to the notion that we don't have to force everyone to exist in our realities and that good design is accessible design. When I am not designing products [software or clothing], you can find me doing curiosity motivated research about neurology, human behavior, the future of immersive design, as well the ethics of running fashion business and what it means to be sustainable. Extremely invested in my passion for design, I allow it to be the golden thread that runs through all the projects that I have the pleasure of working on.</p><br><p></p>",
                                    "name": "Nozi Nindie",
                                    "priority": 1,
                                    "profilePic": "img/speakers/NoziNindie.png"
                                }
                            ],
                            "description": "<p>How you think about the person you are designing for, will affect the impact the product or service had on their lives. As human beings, we have long adapted to our environment; be it physiological, genetic or cultural. However, as we have advanced technologically, and started to make our environments adapt to us, we have left our fellow humans out in the process. As a result, by not intentionally including people living with disabilities, we exclude them from participating in this new world we are creating. The web is one of those places where we deprioritize web accessibility for a variety of reasons; you may attribute it to lack of time, resources and more. In this time, I will share my journey to understanding web accessibility and the things I have learned along the way so far.</p><br><p></p>",
                            "name": "Perspective: An Ode to accessibility",
                            "locationId": "ballroom",
                            "timeStart": "10:30 am",
                            "timeEnd": "11:15 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Nozi Nindie"
                            ]
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>Burgert Kirsten is a team coach and experienced improvisation theatre actor with a masters degree in Organisational Psychology. He based his Master’s thesis on the use of improvisation theatre techniques to create a climate for team innovation. He is one of 34 certified Applied Improvisation practitioners in the world. He also has a Professional Scrum Master (PSM I) certification. He has facilitated team innovation workshops for companies like Siemens and SAB Miller among others. He has also worked with technology start ups to help them develop company cultures that foster innovation. In 2015 one of the start-ups Burgert worked with, Ikubu, was acquired by Garmin for their development of an innovative product for cyclists. He has conducted coaching skills workshops using his unique techniques for Business schools including GIBS, USB and WITS. He has completed a Agile fundamentals course (ICAgile certified) presented by Just Plain Agile, a brain-based coaching certification presented by the NeuroLeadership Group and an advanced course in Organizational and Relationships Systems coaching presented by CRR Global.  Currently he works fulltime as a Scrum Master at Entersekt.</p><br><p></p>",
                                    "name": "Burgert Kirsten",
                                    "priority": 1,
                                    "profilePic": "img/speakers/burgert.jpg"
                                }
                            ],
                            "description": "<p/>Like an Agile Team, a group of Improv Comedy actors need to function creatively and collaboratively under pressure. The practice of improv exercises in Agile teams can help develop meta skills to increase the team’s collaboration, communication and a climate for innovation.</p><br><p></p>",
                            "name": "Doing Agile vs. Being Agile – An Improvisational Mindset for Agile Teams, Leaders and Coaches",
                            "locationId": "gala-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "12:00 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Burgert Kirsten"
                            ]
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>I am passionate about helping teams and people grow and improve, I enjoy helping teams and organizations implement and improve their agile practices. I am a graduate of Jerry Weinberg, Esther Derby and Johanna Rothman's PSL (Problem solving leadership) and I have worked for more than a decade in the software industry in all areas of software development. I am interested in both people and process improvement and continuously learning and finding better ways to solve problems. I have worked as a product owner, scrum master and team member. I have worked with different types and sizes of teams, some starting out their Agile journey and some having been on that path for long. I have learned from these teams and helped them learn from me. I love what I do and I like to have fun while working. Outside of all of this I enjoy reading, good food, good wine and the occasional good whiskey.</p><br><p></p>",
                                    "name": "Jo Perold",
                                    "priority": 1,
                                    "profilePic": "img/speakers/joperold.jpg"
                                },
                                {
                                    "about": "<p>Sonja is a thought partner to decision-makers and change agents. She specialises in applying methods, thinking and tools from fields like complexity, adaptive leadership, network theory and ecological sciences to design bespoke processes to enable change resilience, adaptive cultures and scaled agility. Sonja has been working in the fields of narrative and complexity since 2002. Before founding More Beyond, she worked as a consultant for PWC and IBM. Sonja has consulted locally and internationally with clients that include the Sasol Group, Barclays, MMI, Anglo American, Harmony Gold, Nedbank, Standard Bank, Liberty, FNB, Gautrain Management Agency, PWC, IBM North America, DSTV, Eskom, SANParks, the Water Research Commission and many others. Sonja trains locally and internationally in complexity and related topics at various academic institutions including the University of Pretoria and GIBS Business School. She is a sought-after speaker in a wide variety of industries and conferences including Agile Summits, OD conferences and TedX Pretoria. Sonja has been the sole South African partner for Prof Dave Snowden’s company Cognitive Edge, the creator of Sensemaker® since 2007. In addition, she is a certified Scrum Master and is also qualified in various individual and team coaching modalities including Narrative Coaching, Analytic Network Coaching and Organisation Systems Relationship Coaching.</p><br><p></p>",
                                    "name": "Sonja Blignaut",
                                    "priority": 1,
                                    "profilePic": ""
                                }
                            ],
                            "description": "<p>When we practically implement or scale agility in our organisation we often run into sticky issues that keep us stuck.  This session will provide participants with practical complexity-based tools to help them get unstuck.</p><br><p></p>",
                            "name": "Making sense of Agile’s sticky issues",
                            "locationId": "boundary-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "12:00 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Jo Perold",
                                "Sonja Blignaut"
                            ]
                        }
                    ]
                },
                {
                    "time": "11:15 am",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>Aslam is an African software developer, by birth and by choice. A couple of decades later and he is convinced that software development is hard, very, very hard.  It throws us into states that come close to being chaotic, and just when we think we figured it, we feel like we just got started.  These days Aslam tries to bind strategy and code with the shortest and tautest of strings, finding the least that we can do to fulfil a strategic intent.  He occasionally tweets as @aslamkhn.</p><br><p></p>",
                                    "name": "Aslam Khan",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Aslam.jpg"
                                }
                            ],
                            "description": "<p>Over the years, I have seen us fall in the same rabbit holes repeatedly, myself included.  This talk will help you spot these holes and avoid them.  And if you are in one, then better to know how to get out. Rather save your energy for the real hard yards of transformation, than digging in holes.</p><br><p></p>",
                            "name": "The Absolute Guide for Agile Rabbit Holes",
                            "locationId": "ballroom",
                            "timeStart": "11:15 am",
                            "timeEnd": "12:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Aslam Khan"
                            ]
                        }
                    ]
                },
                {
                    "time": "12:00 pm",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>I am the DevOps Tech Lead at DVT - A software and testing company who is able to facilitate the full life-cycle of software, from scrum masters through to support I have been involved in the software industry for more than ten years, I hold a degree in IT.</p><br><p></p>",
                                    "name": "Lowe Richter",
                                    "profilePic": "img/speakers/Lowe.jpg",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>The talk would be fleshing out how DevOps promotes true agility (taking Agile to the next level), we'll discuss some of the ways to start implementing DevOps.</p><br><p></p>",
                            "name": "DevOps - The Journey To Collaboration",
                            "locationId": "boundary-room",
                            "timeStart": "12:00 pm",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Lowe Richter"
                            ]
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>Riaan is currently working as a Software Engineer at Jemstep and has worked accross various industries, practicing everything from designated keyboard cleaner to solutions architect. Riaan has a passion to make the practice of software development safe - for engineers, companies, clients and the public.</p><br><p></p>",
                                    "name": "Riaan du Plessis",
                                    "priority": 1,
                                    "profilePic": "img/speakers/TanyaandRiaan.jpg"
                                },
                                {
                                    "about": "<p>Tanya has over the course of 13 years fulfilled various roles the HR field accross multiple industries. Her 'why' is to make the workplace a better place for everyone and practices as a Industrial Psychologist to fulfill this mission.</p><br><p></p>",
                                    "name": "Tanya du Plessis",
                                    "priority": 1,
                                    "profilePic": "img/speakers/TanyaandRiaan.jpg"
                                }
                            ],
                            "description": "<p>Do you ever feel that the fire inside you has burned out? Burnout is a prevalent issue among IT professionals. A recent Blind survey shows that an average of 57% of employees from 30 tech companies reported burnout.</p><br><p></p>",
                            "name": "Burn Out",
                            "locationId": "gala-room",
                            "timeStart": "12:00 pm",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Riaan du Plessis",
                                "Tanya du Plessis"
                            ]
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>I have never done a waterfall project… From my first year of education as a Computer Scientist (in Denmark) we were taught to work in an Agile environment and therefore it became a natural part of me. Agile methods became so instilled into my everyday life that I did not realize people could work any differently. I was first exposed to working with teams that did not practice Agile approaches when I moved to South Africa. It was here I realized that I want everybody to feel the passion and joy for Agile as I do, and therefore I started to train and coach all things Agile. I am all about going the extra mile to make the impossible possible. I very much emphasize possibilities rather than limitations and I love to use my creative and imaginative side. I use all of these strengths to help people, teams, and companies to understand Agile and the Scrum framework as well as how to implement it.</p><br><p></p>",
                                    "name": "Malene Jacobsen",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Malene.jpg"
                                }
                            ],
                            "description": "<p>Speed dating, really? Yes:) In this short lightning talk I will introduce how you can use the principles from speed dating to improve your team by giving personal feedback in an environment set up for it. Furthermore, I will share what impact it has had on teams I have worked with.</p><br><p></p>",
                            "name": "Lightning Talk: Speed Dating",
                            "locationId": "ballroom",
                            "timeStart": "12:00 pm",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Malene Jacobsen"
                            ]
                        }
                    ]
                },
                {
                    "time": "12:15 pm",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>#Who am I? Professional caffeine consumer. Occasionally, I also write code, write things that are not code, read books and dabble in business. I also teach people on the Internet about programming stuff.</p><br><p></p>",
                                    "name": "Riaan Nel",
                                    "priority": 1,
                                    "profilePic": "img/speakers/RiaanNel.JPG"
                                }
                            ],
                            "description": "<p>Many people claim to 'do Agile', but what do we really do?  Sure, we follow the ceremonies, but do we want to accomplish?  Do we use what's appropriate and discard what's not?  Are we measuring the right things? I don't have all the answers, but I want to help you to ask the right questions.</p><br><p></p>",
                            "name": "Lightning Talk: Quit the Cargo Cult - Talking from the Trenches",
                            "locationId": "ballroom",
                            "timeStart": "12:15 pm",
                            "timeEnd": "12:30 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Riaan Nel"
                            ]
                        }
                    ]
                },
                {
                    "time": "1:30 pm",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>Zayne is fascinated by one of  humanity’s major contradictions - our need to constantly evolve, change and adapt, but our general unwillingness and fear of doing so. To this end he’s been working with individuals, teams and organisations trying to find the best ways to convince (and perhaps coerce) them to embrace the change that just isn’t going to let up.</p><br><p></p>",
                                    "name": " Zayne Upton",
                                    "priority": 1,
                                    "profilePic": "img/speakers/zayne.jpeg"
                                }
                            ],
                            "description": "<p>As coaches we’re great at observing issues with teams. We see clearly the myriad ways they need to improve and change to become ‘more agile’. Wouldn’t it be great it we could see just as clearly how we also need to change and improve? What if we could somehow see our own blind spots?</p><br><p></p>",
                            "name": "The Agile Blind Spot",
                            "locationId": "ballroom",
                            "timeStart": "1:30 pm",
                            "timeEnd": "2:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Zayne Upton"
                            ]
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>Alain King is an Architect and Trainer at KRS, a software development company based in Cape Town. Alain has run the KRS annual developer internship for the last 9 years, built on the Agile principles of Scrum and Extreme Programming (XP). Alain has been actively involved in upgrading legacy systems.</p><br><p></p>",
                                    "name": "Alain King",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Alain.jpg"
                                }
                            ],
                            "description": "<p>More developers work on Legacy Systems than green fields development. Legacy code contains a wealth of lessons learnt. This talk looks at upgrading legacy while keeping the lessons, and provides a series of learnings that make this possible. Embrace what's possible and love legacy systems again.</p><br><p></p>",
                            "name": "How to handle legacy",
                            "locationId": "gala-room",
                            "timeStart": "1:30 pm",
                            "timeEnd": "2:15 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Alain King"
                            ]
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>Nico was appointed as CTO of Turfsport in April 2017 - about a year after the modernisation project started. His previous experience in the Banking industry (FNB) is a great help at Turfsport as he has extensive experience in various project management approaches as well as modern technologies such as Cloud and more specifically SaaS solutions. His experience as the Cloud Information Security Officer for FirstRand where he was involved in all cloud based projects within the group, also proved a great benefit to Turfsport. He also has experience in talking at various conferences - details on his [LinkedIn](https://www.linkedin.com/in/nicocoetzee/) page under projects. Nico achieved his Master in Engineering from WITS.</p><br><p></p>",
                                    "name": "Nico Coetzee",
                                    "priority": 1,
                                    "profilePic": "img/speakers/nico.jpg"
                                }
                            ],
                            "description": "<p>In South Africa, our software has to meet the SANS 1718-4:2008 standard. Our software must be vetted by an independent laboratory before the regulators will approve the production roll out. The process takes up to 2 months and have placed some unique challenges on our way of work.</p><br><p></p>",
                            "name": "Achieving top quality and agility in a regulated environment",
                            "locationId": "boundary-room",
                            "timeStart": "1:30 pm",
                            "timeEnd": "2:15 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Nico Coetzee"
                            ]
                        }
                    ]
                },
                {
                    "time": "2:30 pm",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>Quality EngineerOrganizer, Agile Kenya meet-up Sandra is a a software quality engineer and tester by profession and has worked in thetechnology field for over five years with various local and international technologycompanies. She is also a TechWomen.org alumna and contributes actively via mentorship tocommunity based projects focusing on education and empowerment of women with STEMskills, she is also a project coordinator for Mombasa Girls in STEM</p><br><p></p>",
                                    "name": "Sandra Kambo",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Sandra.jpeg"
                                },
                                {
                                    "about": "<p>Certified Scrum MasterOrganizer, Agile Kenya meet-upKaluhi is a Certified Scrum Master and passionate about the people side of the change, witha focus on bringing meaningful change into an organisation. She has been practising AgileMethods for over 4 years in both software and non software teams. She is also more deeplyinvolved in the Agile community in Kenya as one of the founders and organizing committeemembers of the community.</p><br><p></p>",
                                    "name": "Kaluhi Anzigale",
                                    "priority": 1,
                                    "profilePic": "img/speakers/kaluhi.jpeg"
                                }
                            ],
                            "description": "<p>A talk to share our experiences on starting and growing the agile community in Kenya as well as the lessons we are learning as our 300 member community grows. The Kenyan agile community currently comprises of tech and non tech companies at different levels of agile growth in their workspaces. Since April 2018, we began holding monthly meet ups and because of this, our growth has been rapid and we have happily come to learn that much as agile in Kenya is pretty young, a lot of our members, just like ourselves are hungry for information on agile principles - from what agile is, to how to go about applying it and even just figuring out, if indeed it is the ‘right’ solution for their work environments.</p><br><p></p>",
                            "name": "Growing the Agile Community in Kenya",
                            "locationId": "ballroom",
                            "timeStart": "2:30 pm",
                            "timeEnd": "3:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Sandra Kambo",
                                "Kaluhi Anzigale"
                            ]
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p></p><br><p></p>",
                                    "name": "Barry Myburgh",
                                    "priority": 1
                                },
                                {
                                    "about": "<p></p><br><p></p>",
                                    "name": "Xolile Maduna",
                                    "priority": 1,
                                    "profilePic": ""
                                },
                                {
                                    "about": "<p></p><br><p></p>",
                                    "name": "Kanya Nkula",
                                    "priority": 1,
                                    "profilePic": ""
                                }
                            ],
                            "description": "<p>Studies show that 90% of start-ups fail in their first year. They fail due to a number of reasons,ignoring customers, costs and disharmony in investors to men on a few. However, the 10% that succeed focus on these elements and ensure that they grow and evolve with the changing market. Tools such as the Lean launchpad and BMC encourage the entrepreneurs to focus on the important segments in the organisation such as interacting with customers and to gather data from interviews in order to gain a better understanding of the opportunity and stakeholder. Studies also show that digital entrepreneurs naturally have a better understanding of the stakeholders and opportunity, however, most digital entrepreneurs lack the ability to run a software development team to deliver and understand the software engineering required for the start-up.</p><br><p></p>",
                            "name": "Workshop: SEMAT Essence: The safety net for Digital Entrepreneurs",
                            "locationId": "gala-room",
                            "timeStart": "2:30 pm",
                            "timeEnd": "4:00 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Barry Myburgh",
                                "Xolile Maduna",
                                "Kanya Nkula"
                            ]
                        },
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>From pathology to people, Henk is a life long learner spreading smiles & energy. With the self-proclaimed title of Chief Happiness Officer, he applies his background in biological science, teaching and business to facilitate way of work optimisation and make the workplace an awesome place to be. Henk lives in Centurion with his wife Elmare, their 4 kids, 3 dogs, 2 cats, an African Grey and 'Tweety' the ageing budgie.</p><br><p></p>",
                                    "name": "Henk Viljoen",
                                    "priority": 1,
                                    "profilePic": "img/speakers/henk.png"
                                }
                            ],
                            "description": "<p>An energised roll-play activity which demonstrates the value benefit of implementing Agile as Way of Work praxis. Specific focus is applied on people, interactions, culture and learning.</p><br><p></p>",
                            "name": "Workshop: Bridging the gap between Agile and ROI - a collaborative learning experience",
                            "locationId": "boundary-room",
                            "timeStart": "2:30 pm",
                            "timeEnd": "4:00 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Henk Viljoen"
                            ]
                        }
                    ]
                },
                {
                    "time": "3:15 pm",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>I am a professional trainer and coach specialising in Agile practices. Over the last 20+ years I have worked in many different industries from the collar and tie of large corporates to the hard-hats and steel-caps of manufacturing. In these industries, I have been responsible for building and leading teams in the delivery and support of customer value primarily using Agile frameworks. I have discovered through this journey that true agility has nothing to with frameworks and processes. True agility is about people, and more importantly, about how people interact with each other. How do we create a culture that self-assesses and corrects over time? How do we ensure that the learned behaviours we pass on are those that we truly value? I love helping people to discover new ways of thinking, learning and relearning. How can we improve the end to end delivery of value together? How do we embark on our own unique journey while embracing the vital elements of respect, focus and simplicity? I ask these questions constantly as we strive to build cohesive and collaborative teams: Magic is formed when people are encouraged to be creative, expressive and collectively responsible. “Make no little plans: they have no magic to stir men’s blood.” - Daniel Burnham</p><br><p></p>",
                                    "name": "Stephen de Villiers Graaff ",
                                    "priority": 1,
                                    "profilePic": "img/speakers/stephen.jpeg"
                                }
                            ],
                            "description": "<p>Poor Leadership is expensive. Certain leadership concepts are crucial to success in a transformational environment. This talk examines the necessary mindset and provides a set of guiding principles to enable leaders and teams achieve extraordinary results in difficult and volatile circumstances.</p><br><p></p>",
                            "name": "Extreme Leadership",
                            "locationId": "ballroom",
                            "timeStart": "3:15 pm",
                            "timeEnd": "4:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Stephen de Villiers Graaff"
                            ]
                        }
                    ]
                },
                {
                    "time": "4:15 pm",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [
                                {
                                    "about": "<p>John Le Drew has spent most of the last 2 decades working in the software industry, with a focus on web technologies. After 10 years as a software engineer John moved into consultancy where he quickly learned the value of team dynamics and how most technical challenges are projecting underlying issues with collaboration. While still being very involved technically, his first focus is on facilitating a safe, creative, collaborative environment. John hosts and produces the well-respected Agile Path podcast where he creates in-depth audio documentaries on the topics that most affect organisations transitioning to agile ways of working and other critical issues. The first season focuses on the effect of psychological safety (or the lack there of) on organisations and wider society. This has led to many speaking engagements across the UK, US and Europe. John’s approach is focused on helping organisations create an environment that fosters creative collaboration. He is known for his infectious passion and sense of humour that brings in a much-needed injection of energy to unmotivated, challenged teams.</p><br><p></p>",
                                    "name": "John Le Drew",
                                    "priority": 1,
                                    "profilePic": ""
                                }
                            ],
                            "description": "<p>While business knowledge and domain expertise is useful and essential, is this only achievable with a 'single wringable neck'? What would happen if the whole team could be encouraged to take ownership of product direction? This session looks at how we have often created dysfunctional relationships with our product owners through both the way we collaborate (or don't) with them and the language we use to talk about the role itself.</p><br><p></p>",
                            "name": "The 5 pillars of Product Management",
                            "locationId": "ballroom",
                            "timeStart": "4:15 pm",
                            "timeEnd": "5:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "John Le Drew"
                            ]
                        }
                    ]
                },
                {
                    "time": "5:15 pm",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [],
                            "description": "<p>Social event</p><br><p></p>",
                            "name": "Networking",
                            "locationId": "ballroom",
                            "timeStart": "5:15 pm",
                            "timeEnd": "7:30 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": []
                        }
                    ]
                }
            ]
        },
        {
            "date": "2nd October 2018",
            "groups": [
                {
                    "time": "7:30 am",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [],
                            "description": "<p></p>",
                            "name": "Lean Coffee (Day 2)",
                            "locationId": "ballroom",
                            "timeStart": "7:30 am",
                            "timeEnd": "8:30 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": []
                        }
                    ]
                },
                {
                    "time": "9:00 am",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [],
                            "description": "<p></p>",
                            "name": "Announcements",
                            "locationId": "ballroom",
                            "timeStart": "9:00 am",
                            "timeEnd": "9:15 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": []
                        }
                    ]
                },
                {
                    "time": "9:15 am",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Sonja is a thought partner to decision-makers and change agents. She specialises in applying methods, thinking and tools from fields like complexity, adaptive leadership, network theory and ecological sciences to design bespoke processes to enable change resilience, adaptive cultures and scaled agility. Sonja has been working in the fields of narrative and complexity since 2002. Before founding More Beyond, she worked as a consultant for PWC and IBM. Sonja has consulted locally and internationally with clients that include the Sasol Group, Barclays, MMI, Anglo American, Harmony Gold, Nedbank, Standard Bank, Liberty, FNB, Gautrain Management Agency, PWC, IBM North America, DSTV, Eskom, SANParks, the Water Research Commission and many others. Sonja trains locally and internationally in complexity and related topics at various academic institutions including the University of Pretoria and GIBS Business School. She is a sought-after speaker in a wide variety of industries and conferences including Agile Summits, OD conferences and TedX Pretoria. Sonja has been the sole South African partner for Prof Dave Snowden’s company Cognitive Edge, the creator of Sensemaker® since 2007. In addition, she is a certified Scrum Master and is also qualified in various individual and team coaching modalities including Narrative Coaching, Analytic Network Coaching and Organisation Systems Relationship Coaching.</p><br><p></p>",
                                    "name": "Sonja Blignaut",
                                    "priority": 1,
                                    "profilePic": ""
                                }
                            ],
                            "description": "<p></p><br><p></p>",
                            "name": "Enabling adaptive cultures: from Agile to agility",
                            "locationId": "ballroom",
                            "timeStart": "9:15 am",
                            "timeEnd": "10:15 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Sonja Blignaut"
                            ]
                        }
                    ]
                },
                {
                    "time": "10:30 am",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [],
                            "description": "<p>Lots of conversations and open space stuff happening here , join the fishbowl, have a look at the posters or just have an impromptu conversation.</p><br><p></p>",
                            "name": "Fishbowl - An open space for conversations and discussions",
                            "locationId": "marathon-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "1:00 pm",
                            "tracks": [
                                "marathon-room"
                            ],
                            "speakerNames": []
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Rochelle loves working with highly motivated individuals and like minded teams who share her interest in adding value an moving forward.  Applying a systems thinking approach to aligning Agile methodologies at organizational level while working with clients to build the correct cultural and context-driven practices is what drives her. She has used the power of Kanban to experiment and explore and use actual data to highlight the true value of Agile and her journey of discovery the depth thereof has just begun. All her experience in the Agile space has given her a strong voice in the organizations she's helped and the teams she has been part of.</p><br><p></p>",
                                    "name": "Rochelle Roos",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Rochelle.JPG"
                                }
                            ],
                            "description": "<p>You get agreement from HR and Management to change the policy in the organization. You will measure the performance of the team as a whole instead of individual performance. Come experience the impact of organizational policies and its effect on performance by playing a fun game.</p><br><p></p>",
                            "name": "Workshop: The Kanban Policy Game",
                            "locationId": "boundary-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Rochelle Roos"
                            ]
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Yogini is an Agile Coach in Absa in Johannesburg.  Yogini is passionate about the learning from the agile community and growing the community. She hosts host Agile Coffee and a Scrum Master Community internally at Absa. Yogini has spoken at Agile Africa and Scrum Gathering in 2017.</p><br><p></p>",
                                    "name": "Yogini Moodley",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Yogini.jpeg"
                                },
                                {
                                    "about": "<p>Mispah is an Agile Coach in Absa in Johannesburg. She is a passionate trainer and has trained in Agile and Lean for several years. She has spoken at Agile Africa 2015.</p><br><p></p>",
                                    "name": "Mispah Carelsen",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Mispah.jpg"
                                }
                            ],
                            "description": "<p>Retrospectives are one of the most important Agile events and can also be the most difficult.  If you are new to running Retros, or looking for some new ideas to improve your Retros, this workshop will take you through Esther Derby & Diana Larsen's Retrospective Structure to add to your toolbox.</p><br><p></p>",
                            "name": "Workshop: Let’s get retrospecting",
                            "locationId": "gala-room",
                            "timeStart": "10:30 am",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Yogini Moodley",
                                "Mispah Carelsen"
                            ]
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Zayne is fascinated by one of  humanity’s major contradictions - our need to constantly evolve, change and adapt, but our general unwillingness and fear of doing so. To this end he’s been working with individuals, teams and organisations trying to find the best ways to convince (and perhaps coerce) them to embrace the change that just isn’t going to let up.</p><br><p></p>",
                                    "name": "Zayne Upton",
                                    "priority": 1,
                                    "profilePic": "img/speakers/zayne.jpeg"
                                },
                                {
                                    "about": "<p>Justin Doyle is an Agile Coach at Liberty. Previously he held the position of Head of Agile at Discovery Vitality and worked to drive the adoption of Agile across the division. In over fourteen years of software development experience he has seen first-hand how technology is changing the world at an exponential rate. In this era of constant change, he firmly believes that we need to create responsive, agile organisations that harness technology and new ways of work to adapt to change and invade the future at speed and scale. This is what drives his passion for Agile. As an Agile Coach he has worked to embed the values, principles and practices needed to create responsive organisations that are effectively equipped to serve their evolutionary purpose and solve real customer needs and problems. History: Justin has presented 3 talks at conferences in the past: a 90 min talk at Scrum Gathering 2013 - Plants vs Zombies – Using team types to build healthier Scrum teams (http://sugsa.org.za/2013-scrum-gathering/justin-doyle-plants-vs-zombies-using-team-types-to-build-healthier-scrum-teams/), and a 30 min talk at Agile Africa 2015 – High Stakes Planning Poker (https://www.youtube.com/watch?v=kRl_bFuSJUQ) and a 15 min lightning talk at Agile Africa 2016 - Active Agile (https://www.youtube.com/watch?v=kPO4Jj6Knns)</p><br><p></p>",
                                    "name": "Justin Doyle",
                                    "priority": 1,
                                    "profilePic": "img/speakers/justinDoyle.jpeg"
                                }
                            ],
                            "description": "<p>Imagine the world of tomorrow, where information, autonomous transportation and renewable energy have been combined at near zero cost to create the third industrial revolution. The possibilities and rate of change in such a world are endless. Will agile as we know it still exist in this new world?</p><br><p></p>",
                            "name": "Agile through the looking glass",
                            "locationId": "ballroom",
                            "timeStart": "10:30 am",
                            "timeEnd": "11:15 am",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Zayne Upton",
                                "Justin Doyle"
                            ]
                        }
                    ]
                },
                {
                    "time": "11:30 am",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>I am long time IT Guy. I've been a typical Java developer moving from opportunity to opportunity, team to team, each time learning a little more about what makes teams and organisations and succeed. I would love to see us all succeed and thus wish to share my learnings.</p><br><p></p>",
                                    "name": "Sizwe Mabanga",
                                    "priority": 1,
                                    "profilePic": "img/speakers/sizwe.jpeg"
                                }
                            ],
                            "description": "<p>I'm pitching an idea I'm calling Cadence about how we can think of agile at scale for a team of teams that makes up a department or portfolio. I suggest a three month cycle over which the team of teams inspects it's goals, tracks itself against stated goals and reviews it's own performance.</p><br><p></p>",
                            "name": "Cadence: a structure for Agile at Scale",
                            "locationId": "ballroom",
                            "timeStart": "11:30 am",
                            "timeEnd": "12:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Sizwe Mabanga"
                            ]
                        }
                    ]
                },
                {
                    "time": "1:15 pm",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>I am a Facilitator & Ontological Coach with a strong connection into Software Development. My formal job titles tend to be around Agile Coach, Transformation Lead or Leadership Facilitator but I prefer to think of myself as a facilitator/ coach who creates spaces for change so that greatness can flow. With 20 years in the Software Development industry I have found that knowing how it gets done blends well with bringing in new ways of working to get it done better. My experience in Agile is founded in Lean and Kanban (with a healthy dose of Scrum and SAFE) and when I am not focused on the behaviours that drive Agility, I am working on visualising change and practically getting work to Flow. In 2018 I left the safety of big corporate to start my own company, Deeply Agile which is all about creating workshops and spaces for change where servant leadership and new, agile cultures can grow. I also hold the Guinness World Record for the Deepest Dive by a Woman (set in 2004 and still current), At the time it placed me in the top 5 deepest divers. I enjoy writing and blogging and have a book on my dive called, Fatally Flawed – The Quest to be Deepest.</p><br><p></p>",
                                    "name": "Verna van Schaik",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Verna.jpg"
                                }
                            ],
                            "description": "<p>Learning cultures don’t just happen. They are a combination of culture, process and people. Explorers do this naturally. Using my Guinness World Record for the Deepest Dive by a woman I unpack what it is that explorers do differently and how you can start to do more of this back in your workplace.</p><br><p></p>",
                            "name": "What Learning Cultures can Learn from World Records and other Explorers",
                            "locationId": "ballroom",
                            "timeStart": "1:15 pm",
                            "timeEnd": "2:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Verna van Schaik"
                            ]
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>I have never done a waterfall project. From my first year of education as a Computer Scientist (in Denmark) we were taught to work in an Agile environment and therefore it became a natural part of me. Agile methods became so instilled into my everyday life that I did not realize people could work any differently. I was first exposed to working with teams that did not practice Agile approaches when I moved to South Africa. It was here I realized that I want everybody to feel the passion and joy for Agile as I do, and therefore I started to train and coach all things Agile. I am all about going the extra mile to make the impossible possible. I very much emphasize possibilities rather than limitations and I love to use my creative and imaginative side. I use all of these strengths to help people, teams, and companies to understand Agile and the Scrum framework as well as how to implement it.</p><br><p></p>",
                                    "name": "Malene Jacobsen",
                                    "priority": 1
                                }
                            ],
                            "description": "<p>Do you want to become a significantly better SM? Through this fun workshop, you will gain knowledge of 6 powerful learning principles based on the best of brain science, which will enable you to create outstanding sessions that people will remember. Plus 7 exercises that you can immediately apply.</p><br><p></p>",
                            "name": "Workshop: Tips and tricks for SM, facilitators, and coaches on how to create outstanding sessions",
                            "locationId": "gala-room",
                            "timeStart": "1:15 pm",
                            "timeEnd": "2:45 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Malene Jacobsen"
                            ]
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Selena Delesie is a leadership and transformation coach, speaker, and author. She is a trusted guide for leaders who seek to improve their business and their life. Selena blends sixteen years of experience in the technology industry with a broad range of studies, to support powerful transformations for individuals, teams, and organizations. The founder of Lead With Love Global and Women Ignited, Selena offers a variety of coaching programs, podcast and virtual leadership conferences. Her clients rave about breaking free from traditional beliefs and practices to engage their strengths and passions—and those around them—for success. Selena is renowned mentor and coach for executives, managers, and teams. She guides & facilitates alignment of vision with strategic goals, transition to empowering work processes, increased productivity and organizational effectiveness.</p><br><p></p>",
                                    "name": "Selena Delesie",
                                    "priority": 1
                                }
                            ],
                            "description": "<p></p><br><p></p>",
                            "name": "Workshop: Agile Managers: Nurture your teams to Thrive",
                            "locationId": "boundary-room",
                            "timeStart": "1:15 pm",
                            "timeEnd": "2:45 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Selena Delesie"
                            ]
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Rouan Wilsenach is a software developer. He has built applications in a variety of technology stacks for companies in the financial services, education, health and media sectors. He’s worked as a consultant and coach, helping teams learn good engineering practices and helping businesses transform the way they build software. He now works remotely for Tes, where he builds full-stack JavaScript microservices to help teachers and schools.</p><br><p></p>",
                                    "name": "Stuart Mann",
                                    "priority": 1,
                                    "profilePic": "img/speakers/StuartMann.jpg"
                                }
                            ],
                            "description": "<p>We deliver stuff but is it valuable? We chase outputs not outcomes. Using feature hypotheses helps us understand the why - and increases the probability we'll build something that delights our customers. This is a practical example of how to do just that.</p><br><p></p>",
                            "name": "The Power of Feature Hypotheses",
                            "locationId": "marathon-room",
                            "timeStart": "1:15 pm",
                            "timeEnd": "2:00 pm",
                            "tracks": [
                                "marathon-room"
                            ],
                            "speakerNames": [
                                "Stuart Mann"
                            ]
                        }
                    ]
                },
                {
                    "time": "2:00 pm",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>I am an experienced enterprise business agility strategist with over 30 years’ experience in driving the realisation of strategic initiatives through strategic business agility initiatives. Whilst operating at a strategic level in the overall business consulting arena, I have become a well renowned expert in enterprise business agility strategies, digital workforce models, workforce planning, human resources strategy, organisation design, talent management, employee engagement, human resources information systems and the Balanced Scorecard. I have well balanced experience in the corporate environment as well as in the consulting field and have successfully executed projects for blue-chip public and private sector clients in South Africa, the rest of Africa, Middle East, North America, Europe and Asia-Pacific.</p><br><p></p>",
                                    "name": "Myles Hopkins",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Myles.png"
                                }
                            ],
                            "description": "<p>The greatest challenge that organisations will face in implementing and embedding agile will be in ensuring that misaligned HR service delivery is overhauled to enable Agile. We have developed the Agile HR Maturity Model for this very purpose and would like to introduce this to the audience.</p><br><p></p>",
                            "name": "True sustainability of Agile Transformation through Agile HR",
                            "locationId": "ballroom",
                            "timeStart": "2:00 pm",
                            "timeEnd": "2:45 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Myles Hopkins"
                            ]
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Agile Coach. Ex-Manager, Ex-Engineer, obsessed with creating environments where people want to do their best work!</p><br><p></p>",
                                    "name": "Bevan Williams",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Bevan.JPG"
                                }
                            ],
                            "description": "<p>As a developer I was constantly frustrated by processes, policies and top down management. I'd like to share insights and lessons of my Agile journey from frustrated Developer to 'slash SM' to Delivery Manager to Agile Coach to show others how this frustration can be significantly reduced.</p><br><p></p>",
                            "name": "The treacherous journey from Developer to Coach",
                            "locationId": "ballroom",
                            "timeStart": "2:00 pm",
                            "timeEnd": "2:45 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Bevan Williams"
                            ]
                        }
                    ]
                },
                {
                    "time": "3:00 pm",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>I'm an Agile Consultant, currently actively coaching and consulting in the Financial services and telecoms sector. My interests are less about doing practices correctly and more about setting up the right culture and support structures to help talented people solve business problems. My ideas and actions are somewhat unconventional but always aimed at creating unexpected learning outcomes. I will be presenting this topic/talk at Agile2018 in San Diego.</p><br><p></p>",
                                    "name": "Renesh Moodley",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Renesh.jpeg"
                                }
                            ],
                            "description": "<p>Are we ready for the next generation of talented people? Do we understand what we need to provide in terms of opportunities and rewards for these innovators to thrive? What needs to change in our current ways of working to prevent a mass exodus of talent to greener pastures?</p><br><p></p>",
                            "name": "Hacking the workforce of the future",
                            "locationId": "ballroom",
                            "timeStart": "3:00 pm",
                            "timeEnd": "3:45 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Renesh Moodley"
                            ]
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Calton is a product management consultant with more than 10 years’ experience working in product management, marketing, design & strategy. Since his start in product management, Calton has worked on researching, creating and optimising products but takes the most joy for developing successful products that seamlessly intertwine business, technology and user experience. Having started his product management career after studying his MBA at Hult International Business School in London, Calton has worked on products in various sectors including Telecoms and the Renewable Energy and has seen the birth, life and death of products and lived to tell the tale. In the past years, he worked on several product ideas experimenting new solutions and technology trends. Calton currently works as a Product Management Consultant at IndigoCube. He is also an ICAgile certified Product Owner and certified trainer.</p><br><p></p>",
                                    "name": "Calton Nhando",
                                    "priority": 1,
                                    "profilePic": "img/speakers/calton.jpeg"
                                }
                            ],
                            "description": "<p>Businesses today, face the threat of rapidly changing competition and market disruption fuelled by the digital age. Experimentation is a major contributing factor for enhancing business agility. By experimenting more and not less you nurture innovation, meet customers’ needs and adapt to the market.</p><br><p></p>",
                            "name": "Continuous Exploration for Business Agility",
                            "locationId": "gala-room",
                            "timeStart": "3:00 pm",
                            "timeEnd": "3:45 pm",
                            "tracks": [
                                "gala-room"
                            ],
                            "speakerNames": [
                                "Calton Nhando"
                            ]
                        },
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>A musician, sports person and an agilist by passion, love and heart. Serving people at Nedbank currently at Johannesburg. Volunteer at various agile communities around the globe</p><br><p></p>",
                                    "name": "Rahul Sharma",
                                    "priority": 1,
                                    "profilePic": "img/speakers/Rahul.JPG"
                                }
                            ],
                            "description": "<p>I will open my life, as a Software Tester in Waterfall projects vs my life in Agile projects. Scenario Based Vs Test Case Based Testing.</p><br><p></p>",
                            "name": "Life in Software Testing: Before and After Agile",
                            "locationId": "boundary-room",
                            "timeStart": "3:00 pm",
                            "timeEnd": "3:45 pm",
                            "tracks": [
                                "boundary-room"
                            ],
                            "speakerNames": [
                                "Rahul Sharma"
                            ]
                        }
                    ]
                },
                {
                    "time": "4:00 pm",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p>Mitch Lacey is an agile practitioner and trainer. Mitch has been managing projects for over fifteen years and is credited with many plan-driven and agile projects. He is the author of “The Scrum Field Guide”, a book targeting teams adopting Agile and Scrum practices. Mitch honed his agile skills at Microsoft Corporation, where he successfully released core enterprise services for Windows Live. Mitch’s first agile team at Microsoft was coached by Ward Cunningham, Jim Newkirk & David Anderson. While at Microsoft, he transitioned from Program Manager to Agile Coach, working hand-in-hand with groups throughout their transition to Agile practices. After Microsoft, Mitch was the Agile Practice Manager at Ascentium Corporation where he practiced agility on the projects he ran every day while coaching customers on agile practices and lessons on agile adoption worldwide. As a Certified Scrum Trainer (CST), PMI Project Management Professional (PMP®) and Agile Certified Practitioner (ACP®), Mitch shares his experience in project and client management through Scrum Alliance Certified Scrum courses, agile coaching engagements, conference presentations, blogs and white papers. He has published many papers including “Adventures in Promiscuous Pairing”, “Transitioning to Agile: Key Lessons Learned in the Field”, “The Impacts of Poor Estimating – & How to Fix It”, a variety of papers for Microsoft and “Immersive Interviewing – Building Great Agile Software Teams”. He has presented at Agile Alliance Agile 2006, 2007, 2008 and 2009 conferences, the 2008 Better Software Conference and the 2008 – 2013 SQE Agile Development Practices conferences. He has managed tracks for the Agile conference since 2008 and was the conference chair for Agile2012 and Agile2014. Mitch has served on the Board of Directors for the Agile Alliance (2011-2012) and the Scrum Alliance (2010-2011, 2014).</p><br><p></p>",
                                    "name": "Mitch Lacey",
                                    "priority": 1,
                                    "profilePic": ""
                                }
                            ],
                            "description": "<p></p><br><p></p>",
                            "name": "Leadership Agility",
                            "locationId": "ballroom",
                            "timeStart": "4:00 pm",
                            "timeEnd": "5:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Mitch Lacey"
                            ]
                        }
                    ]
                },
                {
                    "time": "5:00 pm",
                    "sessions": [
                        {
                            "date": "2nd October 2018",
                            "speakers": [
                                {
                                    "about": "<p></p>",
                                    "name": "Alok Goswami",
                                    "priority": 1
                                },
                                {
                                    "about": "<p></p>",
                                    "name": "Joanne Perold",
                                    "profilePic": "img/speakers/joanne.jpg",
                                    "priority": 1
                                },
                                {
                                    "about": "<p></p>",
                                    "name": "Barry Dwolatzky",
                                    "priority": 1,
                                    "profilePic": ""
                                }
                            ],
                            "description": "<p></p>",
                            "name": "Closing and prize draw",
                            "locationId": "ballroom",
                            "timeStart": "5:00 pm",
                            "timeEnd": "5:15 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": [
                                "Alok Goswami",
                                "Joanne Perold",
                                "Barry Dwolatzky"
                            ]
                        }
                    ]
                },
                {
                    "time": "5:15 pm",
                    "sessions": [
                        {
                            "date": "1st OCtober 2018",
                            "speakers": [],
                            "description": "<p>Social event</p><br><p></p>",
                            "name": "Closing Drinks and Networking",
                            "locationId": "ballroom",
                            "timeStart": "5:15 pm",
                            "timeEnd": "7:00 pm",
                            "tracks": [
                                "ballroom"
                            ],
                            "speakerNames": []
                        }
                    ]
                }
            ]
        }
    ],
    "speakers": [
        {
            "about": "<p>Selena Delesie is a leadership and transformation coach, speaker, and author. She is a trusted guide for leaders who seek to improve their business and their life. Selena blends sixteen years of experience in the technology industry with a broad range of studies, to support powerful transformations for individuals, teams, and organizations. The founder of Lead With Love Global and Women Ignited, Selena offers a variety of coaching programs, podcast and virtual leadership conferences. Her clients rave about breaking free from traditional beliefs and practices to engage their strengths and passions—and those around them—for success. Selena is renowned mentor and coach for executives, managers, and teams. She guides & facilitates alignment of vision with strategic goals, transition to empowering work processes, increased productivity and organizational effectiveness.</p><br><p></p>",
            "name": "Selena Delasie",
            "profilePic": "",
            "priority": 0,
            "twitter": "@SelenaDelesie",
            "contentLink": ""
        },
        {
            "about": "<p>John Le Drew has spent most of the last 2 decades working in the software industry, with a focus on web technologies. After 10 years as a software engineer John moved into consultancy where he quickly learned the value of team dynamics and how most technical challenges are projecting underlying issues with collaboration. While still being very involved technically, his first focus is on facilitating a safe, creative, collaborative environment. John hosts and produces the well-respected Agile Path podcast where he creates in-depth audio documentaries on the topics that most affect organisations transitioning to agile ways of working and other critical issues. The first season focuses on the effect of psychological safety (or the lack there of) on organisations and wider society. This has led to many speaking engagements across the UK, US and Europe. John’s approach is focused on helping organisations create an environment that fosters creative collaboration. He is known for his infectious passion and sense of humour that brings in a much-needed injection of energy to unmotivated, challenged teams.</p><br><p></p>",
            "name": "John Le Drew",
            "priority": 1,
            "twitter": "@antz29",
            "contentLink": ""
        },
        {
            "about": "<p>Mitch Lacey is an agile practitioner and trainer. Mitch has been managing projects for over fifteen years and is credited with many plan-driven and agile projects. He is the author of “The Scrum Field Guide”, a book targeting teams adopting Agile and Scrum practices. Mitch honed his agile skills at Microsoft Corporation, where he successfully released core enterprise services for Windows Live. Mitch’s first agile team at Microsoft was coached by Ward Cunningham, Jim Newkirk & David Anderson. While at Microsoft, he transitioned from Program Manager to Agile Coach, working hand-in-hand with groups throughout their transition to Agile practices. After Microsoft, Mitch was the Agile Practice Manager at Ascentium Corporation where he practiced agility on the projects he ran every day while coaching customers on agile practices and lessons on agile adoption worldwide. As a Certified Scrum Trainer (CST), PMI Project Management Professional (PMP®) and Agile Certified Practitioner (ACP®), Mitch shares his experience in project and client management through Scrum Alliance Certified Scrum courses, agile coaching engagements, conference presentations, blogs and white papers. He has published many papers including “Adventures in Promiscuous Pairing”, “Transitioning to Agile: Key Lessons Learned in the Field”, “The Impacts of Poor Estimating – & How to Fix It”, a variety of papers for Microsoft and “Immersive Interviewing – Building Great Agile Software Teams”. He has presented at Agile Alliance Agile 2006, 2007, 2008 and 2009 conferences, the 2008 Better Software Conference and the 2008 – 2013 SQE Agile Development Practices conferences. He has managed tracks for the Agile conference since 2008 and was the conference chair for Agile2012 and Agile2014. Mitch has served on the Board of Directors for the Agile Alliance (2011-2012) and the Scrum Alliance (2010-2011, 2014).</p><br><p></p>",
            "name": "Mitch Lacey",
            "priority": 1,
            "twitter": "@mglacey",
            "contentLink": ""
        },
        {
            "about": "<p>Sonja is a thought partner to decision-makers and change agents. She specialises in applying methods, thinking and tools from fields like complexity, adaptive leadership, network theory and ecological sciences to design bespoke processes to enable change resilience, adaptive cultures and scaled agility. Sonja has been working in the fields of narrative and complexity since 2002. Before founding More Beyond, she worked as a consultant for PWC and IBM. Sonja has consulted locally and internationally with clients that include the Sasol Group, Barclays, MMI, Anglo American, Harmony Gold, Nedbank, Standard Bank, Liberty, FNB, Gautrain Management Agency, PWC, IBM North America, DSTV, Eskom, SANParks, the Water Research Commission and many others. Sonja trains locally and internationally in complexity and related topics at various academic institutions including the University of Pretoria and GIBS Business School. She is a sought-after speaker in a wide variety of industries and conferences including Agile Summits, OD conferences and TedX Pretoria. Sonja has been the sole South African partner for Prof Dave Snowden’s company Cognitive Edge, the creator of Sensemaker® since 2007. In addition, she is a certified Scrum Master and is also qualified in various individual and team coaching modalities including Narrative Coaching, Analytic Network Coaching and Organisation Systems Relationship Coaching.</p><br><p></p>",
            "name": "Sonja Blignaut",
            "priority": 1,
            "profilePic": "",
            "twitter": "@sonjabl",
            "contentLink": ""
        },
        {
            "about": "<p>Burgert Kirsten is a team coach and experienced improvisation theatre actor with a masters degree in Organisational Psychology. He based his Master’s thesis on the use of improvisation theatre techniques to create a climate for team innovation. He is one of 34 certified Applied Improvisation practitioners in the world. He also has a Professional Scrum Master (PSM I) certification. He has facilitated team innovation workshops for companies like Siemens and SAB Miller among others. He has also worked with technology start ups to help them develop company cultures that foster innovation. In 2015 one of the start-ups Burgert worked with, Ikubu, was acquired by Garmin for their development of an innovative product for cyclists. He has conducted coaching skills workshops using his unique techniques for Business schools including GIBS, USB and WITS. He has completed a Agile fundamentals course (ICAgile certified) presented by Just Plain Agile, a brain-based coaching certification presented by the NeuroLeadership Group and an advanced course in Organizational and Relationships Systems coaching presented by CRR Global.  Currently he works fulltime as a Scrum Master at Entersekt.</p><br><p></p>",
            "name": "Burgert Kirsten",
            "twitter": "@burgertk",
            "priority": 1,
            "profilePic": "img/speakers/burgert.jpg",
            "contentLink": ""
        },
        {
            "about": "<p>Aslam is an African software developer, by birth and by choice. A couple of decades later and he is convinced that software development is hard, very, very hard.  It throws us into states that come close to being chaotic, and just when we think we figured it, we feel like we just got started.  These days Aslam tries to bind strategy and code with the shortest and tautest of strings, finding the least that we can do to fulfil a strategic intent.  He occasionally tweets as @aslamkhn.</p><br><p></p>",
            "name": "Aslam Khan",
            "priority": 1,
            "profilePic": "img/speakers/Aslam.jpg",
            "twitter": "@aslamkhn",
            "contentLink": ""
        },
        {
            "about": "<p>Zayne is fascinated by one of  humanity’s major contradictions - our need to constantly evolve, change and adapt, but our general unwillingness and fear of doing so. To this end he’s been working with individuals, teams and organisations trying to find the best ways to convince (and perhaps coerce) them to embrace the change that just isn’t going to let up.</p><br><p></p>",
            "name": "Zayne Upton",
            "priority": 1,
            "profilePic": "img/speakers/zayne.jpeg",
            "twitter": "@songsta",
            "contentLink": ""
        },
        {
            "about": "<p>Justin Doyle is an Agile Coach at Liberty. Previously he held the position of Head of Agile at Discovery Vitality and worked to drive the adoption of Agile across the division. In over fourteen years of software development experience he has seen first-hand how technology is changing the world at an exponential rate. In this era of constant change, he firmly believes that we need to create responsive, agile organisations that harness technology and new ways of work to adapt to change and invade the future at speed and scale. This is what drives his passion for Agile. As an Agile Coach he has worked to embed the values, principles and practices needed to create responsive organisations that are effectively equipped to serve their evolutionary purpose and solve real customer needs and problems. History: Justin has presented 3 talks at conferences in the past: a 90 min talk at Scrum Gathering 2013 - Plants vs Zombies – Using team types to build healthier Scrum teams (http://sugsa.org.za/2013-scrum-gathering/justin-doyle-plants-vs-zombies-using-team-types-to-build-healthier-scrum-teams/), and a 30 min talk at Agile Africa 2015 – High Stakes Planning Poker (https://www.youtube.com/watch?v=kRl_bFuSJUQ) and a 15 min lightning talk at Agile Africa 2016 - Active Agile (https://www.youtube.com/watch?v=kPO4Jj6Knns).</p><br><p></p>",
            "name": "Justin Doyle",
            "priority": 1,
            "profilePic": "img/speakers/justinDoyle.jpeg",
            "twitter": "@doyle_justin",
            "contentLink": ""
        },
        {
            "about": "<p>Calton is a product management consultant with more than 10 years’ experience working in product management, marketing, design & strategy. Since his start in product management, Calton has worked on researching, creating and optimising products but takes the most joy for developing successful products that seamlessly intertwine business, technology and user experience. Having started his product management career after studying his MBA at Hult International Business School in London, Calton has worked on products in various sectors including Telecoms and the Renewable Energy and has seen the birth, life and death of products and lived to tell the tale. In the past years, he worked on several product ideas experimenting new solutions and technology trends. Calton currently works as a Product Management Consultant at IndigoCube. He is also an ICAgile certified Product Owner and certified trainer.</p><br><p></p>",
            "name": "Calton Nhando",
            "priority": 1,
            "profilePic": "img/speakers/calton.jpeg",
            "twitter":"@caltonsk",
            "contentLink": ""
        },
        {
            "about": "<p>I am long time IT Guy. I've been a typical Java developer moving from opportunity to opportunity, team to team, each time learning a little more about what makes teams and organisations and succeed. I would love to see us all succeed and thus wish to share my learnings.</p><br><p></p>",
            "name": "Sizwe Mabanga",
            "priority": 1,
            "profilePic": "img/speakers/sizwe.jpeg",
            "twitter": "@sizwethekingrat",
            "contentLink": ""
        },
        {
            "about": "#Who am I? Professional caffeine consumer. Occasionally, I also write code, write things that are not code, read books and dabble in business.  I also teach people on the Internet about programming stuff.</p><br><p></p>",
            "name": "Riaan Nel",
            "priority": 1,
            "profilePic": "img/speakers/RiaanNel.JPG",
            "twitter": "@rambling_riaan",
            "contentLink": ""
        },
        {
            "about": "<p>A musician, sports person and an agilist by passion, love and heart. Serving people at Nedbank currently at Johannesburg. Volunteer at various agile communities around the globe.</p><br><p></p>",
            "name": "Rahul Sharma",
            "priority": 1,
            "profilePic": "img/speakers/Rahul.JPG",
            "twitter": "@RahulSh13",
            "contentLink": ""
        },
        {
            "about": "<p>Justin Doyle is an Agile Coach at Liberty. Previously he held the position of Head of Agile at Discovery Vitality and worked to drive the adoption of Agile across the division. In over fourteen years of software development experience he has seen first-hand how technology is changing the world at an exponential rate. In this era of constant change, he firmly believes that we need to create responsive, agile organisations that harness technology and new ways of work to adapt to change and invade the future at speed and scale. This is what drives his passion for Agile. As an Agile Coach he has worked to embed the values, principles and practices needed to create responsive organisations that are effectively equipped to serve their evolutionary purpose and solve real customer needs and problems.</p><br><p></p>",
            "name": "Justin Doyle",
            "priority": 1,
            "profilePic": "",
            "twitter": "@doyle_justin",
            "contentLink": ""
        },
        {
            "about": "<p>I have never done a waterfall project. From my first year of education as a Computer Scientist (in Denmark) we were taught to work in an Agile environment and therefore it became a natural part of me. Agile methods became so instilled into my everyday life that I did not realize people could work any differently. I was first exposed to working with teams that did not practice Agile approaches when I moved to South Africa. It was here I realized that I want everybody to feel the passion and joy for Agile as I do, and therefore I started to train and coach all things Agile. I am all about going the extra mile to make the impossible possible. I very much emphasize possibilities rather than limitations and I love to use my creative and imaginative side. I use all of these strengths to help people, teams, and companies to understand Agile and the Scrum framework as well as how to implement it.</p><br><p></p>",
            "name": "Malene Jacobsen",
            "priority": 1,
            "profilePic": "img/speakers/Malene.jpg",
            "twitter": "@MaleneMBJ",
            "contentLink": ""
        },
        {
            "about": "<p>Alain King is an Architect and Trainer at KRS, a software development company based in Cape Town. Alain has run the KRS annual developer internship for the last 9 years, built on the Agile principles of Scrum and Extreme Programming (XP). Alain has been actively involved in upgrading legacy systems.</p><br><p></p>",
            "name": "Alain King",
            "priority": 1,
            "profilePic": "img/speakers/Alain.jpg",
            "twitter": "@alainkingza",
            "contentLink": ""
        },
        {
            "about": "<p>Rochelle loves working with highly motivated individuals and like minded teams who share her interest in adding value an moving forward.  Applying a systems thinking approach to aligning Agile methodologies at organizational level while working with clients to build the correct cultural and context-driven practices is what drives her. She has used the power of Kanban to experiment and explore and use actual data to highlight the true value of Agile and her journey of discovery the depth thereof has just begun. All her experience in the Agile space has given her a strong voice in the organizations she's helped and the teams she has been part of.</p><br><p></p>",
            "name": "Rochelle Roos",
            "priority": 1,
            "profilePic": "img/speakers/Rochelle.JPG",
            "twitter": "@spryagility",
            "contentLink": ""
        },
        {
            "about": "<p>Nico was appointed as CTO of Turfsport in April 2017 - about a year after the modernisation project started. His previous experience in the Banking industry (FNB) is a great help at Turfsport as he has extensive experience in various project management approaches as well as modern technologies such as Cloud and more specifically SaaS solutions. His experience as the Cloud Information Security Officer for FirstRand where he was involved in all cloud based projects within the group, also proved a great benefit to Turfsport. He also has experience in talking at various conferences - details on his [LinkedIn](https://www.linkedin.com/in/nicocoetzee/) page under projects. Nico achieved his Master in Engineering from WITS.</p><br><p></p>",
            "name": "Nico Coetzee",
            "priority": 1,
            "profilePic": "img/speakers/nico.jpg",
            "twitter": "@nicocoetzee1",
            "contentLink": ""
        },
        {
            "about": "<p>From pathology to people, Henk is a life long learner spreading smiles & energy. With the self-proclaimed title of Chief Happiness Officer, he applies his background in biological science, teaching and business to facilitate way of work optimisation and make the workplace an awesome place to be. Henk lives in Centurion with his wife Elmare, their 4 kids, 3 dogs, 2 cats, an African Grey and 'Tweety' the ageing budgie.</p><br><p></p>",
            "name": "Henk Viljoen",
            "priority": 1,
            "profilePic": "img/speakers/henk.png",
            "twitter": "@agiledude_henk",
            "contentLink": ""
        },
        {
            "about": "<p>I am a Facilitator & Ontological Coach with a strong connection into Software Development. My formal job titles tend to be around Agile Coach, Transformation Lead or Leadership Facilitator but I prefer to think of myself as a facilitator/ coach who creates spaces for change so that greatness can flow. With 20 years in the Software Development industry I have found that knowing how it gets done blends well with bringing in new ways of working to get it done better. My experience in Agile is founded in Lean and Kanban (with a healthy dose of Scrum and SAFE) and when I am not focused on the behaviours that drive Agility, I am working on visualising change and practically getting work to Flow. In 2018 I left the safety of big corporate to start my own company, Deeply Agile which is all about creating workshops and spaces for change where servant leadership and new, agile cultures can grow. I also hold the Guinness World Record for the Deepest Dive by a Woman (set in 2004 and still current), At the time it placed me in the top 5 deepest divers. I enjoy writing and blogging and have a book on my dive called, Fatally Flawed – The Quest to be Deepest.</p><br><p></p>",
            "name": "Verna van Schaik",
            "priority": 1,
            "profilePic": "img/speakers/Verna.jpg",
            "twitter": "@vernav",
            "contentLink": ""
        },
        {
            "about": "<p>I am an experienced enterprise business agility strategist with over 30 years’ experience in driving the realisation of strategic initiatives through strategic business agility initiatives. Whilst operating at a strategic level in the overall business consulting arena, I have become a well renowned expert in enterprise business agility strategies, digital workforce models, workforce planning, human resources strategy, organisation design, talent management, employee engagement, human resources information systems and the Balanced Scorecard. I have well balanced experience in the corporate environment as well as in the consulting field and have successfully executed projects for blue-chip public and private sector clients in South Africa, the rest of Africa, Middle East, North America, Europe and Asia-Pacific.</p><br><p></p>",
            "name": "Myles Hopkins",
            "priority": 1,
            "profilePic": "img/speakers/Myles.png",
            "contentLink": ""
        },
        {
            "about": "<p>Stuart Mann is a reformed waterfall guy who is now a passionate Agile Coach. By day he is responsible for the agile transformation at Standard Bank CIB. At all other times he is a father (two girls), husband (one wife) and trainee feminist. In whatever spare time is leftover, Stuart is a compulsive marathon runner. He has run 190 marathons and ultras and writes a monthly column for South Africa's largest running publication (Modern Athlete). Stuart's lifetime ambition is to secure a beer sponsor.</p><br><p></p>",
            "name": "Stuart Mann",
            "priority": 1,
            "profilePic": "img/speakers/StuartMann.jpg",
            "twitter": "@runningmann100",
            "contentLink": ""
        },
        {
            "about": "<p>I'm an Agile Consultant, currently actively coaching and consulting in the Financial services and telecoms sector. My interests are less about doing practices correctly and more about setting up the right culture and support structures to help talented people solve business problems. My ideas and actions are somewhat unconventional but always aimed at creating unexpected learning outcomes. I will be presenting this topic/talk at Agile2018 in San Diego.</p><br><p></p>",
            "name": "Renesh Moodley",
            "priority": 1,
            "twitter": "@reneshm",
            "profilePic": "img/speakers/Renesh.jpeg",
            "contentLink": ""
        },
        {
            "about": "<p>I am a professional trainer and coach specialising in Agile practices. Over the last 20+ years I have worked in many different industries from the collar and tie of large corporates to the hard-hats and steel-caps of manufacturing. In these industries, I have been responsible for building and leading teams in the delivery and support of customer value primarily using Agile frameworks. I have discovered through this journey that true agility has nothing to with frameworks and processes. True agility is about people, and more importantly, about how people interact with each other. How do we create a culture that self-assesses and corrects over time? How do we ensure that the learned behaviours we pass on are those that we truly value? I love helping people to discover new ways of thinking, learning and relearning. How can we improve the end to end delivery of value together? How do we embark on our own unique journey while embracing the vital elements of respect, focus and simplicity? I ask these questions constantly as we strive to build cohesive and collaborative teams: Magic is formed when people are encouraged to be creative, expressive and collectively responsible. “Make no little plans: they have no magic to stir men’s blood.” - Daniel Burnham</p><br><p></p>",
            "name": "Stephen de Villiers Graaff",
            "priority": 1,
            "twitter": "@gravworks",
            "profilePic": "img/speakers/stephen.jpeg",
            "contentLink": ""
        },
        {
            "about": "<p>Agile Coach. Ex-Manager, Ex-Engineer, obsessed with creating environments where people want to do their best work!</p><br><p></p>",
            "name": "Bevan Williams",
            "priority": 1,
            "twitter": "@bevanwilliams",
            "profilePic": "img/speakers/Bevan.JPG",
            "contentLink": ""
        },
        {
            "about": "<p>Yogini is an Agile Coach in Absa in Johannesburg.  Yogini is passionate about the learning from the agile community and growing the community. She hosts host Agile Coffee and a Scrum Master Community internally at Absa. Yogini has spoken at Agile Africa and Scrum Gathering in 2017.</p><br><p></p>",
            "name": "Yogini Moodley",
            "priority": 1,
            "profilePic": "img/speakers/Yogini.jpeg",
            "twitter": "@yogini_zn",
            "contentLink": ""
        },
        {
            "about": "<p>Mispah is an Agile Coach in Absa in Johannesburg. She is a passionate trainer and has trained in Agile and Lean for several years. She has spoken at Agile Africa 2015.</p><br><p></p>",
            "name": "Mispah Carelsen",
            "priority": 1,
            "profilePic": "img/speakers/Mispah.jpg",
            "twitter": "@mispahhc",
            "contentLink": ""
        },
        {
            "about": "<p>I am the DevOps Tech Lead at DVT - A software and testing company who is able to facilitate the full life-cycle of software, from scrum masters through to support I have been involved in the software industry for more than ten years, I hold a degree in IT.</p><br><p></p>",
            "name": "Lowe Richter",
            "priority": 1,
            "profilePic": "img/speakers/Lowe.jpg",
            "contentLink": ""
        },
        {
            "about": "<p>I am passionate about helping teams and people grow and improve, I enjoy helping teams and organizations implement and improve their agile practices. I am a graduate of Jerry Weinberg, Esther Derby and Johanna Rothman's PSL (Problem solving leadership) and I have worked for more than a decade in the software industry in all areas of software development. I am interested in both people and process improvement and continuously learning and finding better ways to solve problems. I have worked as a product owner, scrum master and team member. I have worked with different types and sizes of teams, some starting out their Agile journey and some having been on that path for long. I have learned from these teams and helped them learn from me. I love what I do and I like to have fun while working. Outside of all of this I enjoy reading, good food, good wine and the occasional good whiskey.</p><br><p></p>",
            "name": "Jo Perold",
            "priority": 1,
            "profilePic": "img/speakers/joperold.jpg",
            "twitter": "@joperold",
            "contentLink": ""
        },
        {
            "about": "<p>Tanya has over the course of 13 years fulfilled various roles the HR field accross multiple industries. Her 'why' is to make the workplace a better place for everyone and practices as a Industrial Psychologist to fulfill this mission.</p><br><p></p>",
            "name": "Tanya du Plessis",
            "priority": 1,
            "profilePic": "img/speakers/TanyaandRiaan.jpg",
            "twitter": "",
            "contentLink": ""
        },
        {
            "about": "<p>Riaan is currently working as a Software Engineer at Jemstep and has worked accross various industries, practicing everything from designated keyboard cleaner to solutions architect. Riaan has a passion to make the practice of software development safe - for engineers, companies, clients and the public.</p><br><p></p>",
            "name": "Riaan du Plessis",
            "priority": 1,
            "profilePic": "img/speakers/TanyaandRiaan.jpg",
            "twitter": "@riaan_dp",
            "contentLink": ""
        },
        {
            "about": "<p></p>",
            "name": "Barry Myburgh",
            "priority": 1,
            "contentLink": ""
        },
        {
            "about": "<p>Quality EngineerOrganizer, Agile Kenya meet-up Sandra is a a software quality engineer and tester by profession and has worked in thetechnology field for over five years with various local and international technologycompanies. She is also a TechWomen.org alumna and contributes actively via mentorship tocommunity based projects focusing on education and empowerment of women with STEMskills, she is also a project coordinator for Mombasa Girls in STEM.</p><br><p></p>",
            "name": "Sandra Kambo",
            "priority": 1,
            "profilePic": "img/speakers/Sandra.jpeg",
            "twitter": "",
            "contentLink": ""
        },
        {
            "about": "<p>Certified Scrum MasterOrganizer, Agile Kenya meet-upKaluhi is a Certified Scrum Master and passionate about the people side of the change, witha focus on bringing meaningful change into an organisation. She has been practising AgileMethods for over 4 years in both software and non software teams. She is also more deeplyinvolved in the Agile community in Kenya as one of the founders and organizing committeemembers of the community.</p><br><p></p>",
            "name": "Kaluhi Anzigale",
            "priority": 1,
            "profilePic": "img/speakers/kaluhi.jpeg",
            "twitter": "",
            "contentLink": ""
        },
        {
            "about": "<p>I am a spirited young woman, feeding on creativity and the things around me. Always thinking and dreaming, I am obsessed with the process of creating something new. With experience in product design, I collaborate within teams to build experiences fit for the humans in the world of corporate banking. I have a keen interest in Inclusive Design because I subscribe to the notion that we don't have to force everyone to exist in our realities and that good design is accessible design. When I am not designing products [software or clothing], you can find me doing curiosity motivated research about neurology, human behavior, the future of immersive design, as well the ethics of running fashion business and what it means to be sustainable. Extremely invested in my passion for design, I allow it to be the golden thread that runs through all the projects that I have the pleasure of working on.</p><br><p></p>",
            "name": "Nozi Nindie",
            "priority": 1,
            "profilePic": "img/speakers/NoziNindie.png",
            "twitter": "@nozi_nindie",
            "contentLink": ""
        }
    ],
    "sponsors": [
        {
            "groupName": "Title Sponsor",
            "color":"#000000",
            "sponsors": [
                {
                    "name": "JCSE",
                    "imageSrc": "img/sponsors/jcse_logo_rgb-280.gif",
                    "url": "http://www.jcse.org.za/"
                }
            ]
        },
        {
            "groupName": "Diamond Sponsor",
            "color":"#9ac5db",
            "sponsors": [
                {
                    "name": "IQ Business",
                    "imageSrc": "img/sponsors/IQBusiness-Logo.png",
                    "url": "http://www.iqbusiness.net/"
                }
            ]
        },
        {
            "groupName": "Gold Sponsors",
            "color":"#FFD700",
            "sponsors": [
                {
                    "name": "Prodigy Finance",
                    "imageSrc": "img/sponsors/Prodigy_LandscapeLogo.jpg",
                    "url": "http://www.prodigyfinance.com/"
                },
                {
                    "name": "Liberty",
                    "imageSrc": "img/sponsors/Liberty.png",
                    "url": "http://www.liberty.co.za/"
                }
            ]
        },
        {
            "groupName": "Silver Sponsors",
            "color":"#C0C0C0",
            "sponsors": [
                {
                    "name": "nReality",
                    "imageSrc": "img/sponsors/nReality-dark-300x79.png",
                    "url": "http://www.nreality.com/"
                },
                {
                    "name": "Agile 42",
                    "imageSrc": "img/sponsors/Agile42-e1497864739541.png",
                    "url": "http://www.agile42.com/"
                }
            ]
        }
    ],
    "map": [
        {
            "name": "dunno",
            "lat": -33.9353866,
            "lng": 18.4550375,
            "center": true
        }
    ],
    "locationMappings": [
        {
            "name": "Ballroom",
            "id": "ballroom",
            "color": "#6285A0"
        },
        {
            "name": "Gala",
            "id": "gala-room",
            "color": "#866686"
        },
        {
            "name": "Boundary",
            "id": "boundary-room",
            "color": "#D95F62"
        },
        {
            "name": "Marathon",
            "id": "marathon-room",
            "color": "#4C9689"
        }
    ]
}
